[{"family": "Acanthaceae", "family_desc": " The Acanthaceae are mostly herbs or shrubs\ncomprising about 250 genera and 2,500 species, including twining forms. The leaves are\nsimple, opposite and decussate; stipules are lacking. The flowers are bisexual,\nzygomorphic, and usually are associated with conspicuous, often brightly colored bracts.\nThe calyx is usually deeply 4-5 lobed or sometimes is highly reduced with more numerous\nminute teeth. The corolla is sympetalous, usually 5-merous, mostly zygomorphic, and\ncommonly 2 lipped. The androecium usually consists of 4 didynamous stamens or only 2\nstamens adnate to the corolla tube or epigynous zone, alternate with the lobes. The\ngynoecium consists of a single compound pistil of 2 carpels, a single style, and a\nsuperior ovary with 2 locules, each with usually 2-10 axile ovules in one or two\ncollateral vertical tiers. An annular nectary disk is usually found around the base of the\novary. The fruit is commonly an elastically dehiscent loculicidal capsule. The seed stalk\nor funiculus of each seed is modified into a hook shaped jaculator or retinaculum that\nfunctions in flinging out the seeds during dehiscence. "}, {"family": "Aceraceae", "family_desc": ""}, {"family": "Achariaceae", "family_desc": ""}, {"family": "Adoxaceae", "family_desc": ""}, {"family": "Aizoaceae", "family_desc": ""}, {"family": "Altingiaceae", "family_desc": ""}, {"family": "Amaranthaceae", "family_desc": " The Amaranthaceae are mostly herbs but\nrarely also shrubs or small trees comprising 65 genera and 900 species further\ncharacterized by the presence of betalains and p-plastids. The leaves are alternate or\nopposite, simple, estipulate, and generally entire. The flowers are bisexual or unisexual,\ntypically very small, and frequently prickly due to bristly perianth and bracts. Each\nflower is subtended by a bract and two bractlets that commonly are scarious or membranous.\nA minute uniseriate perianth of 3-5, distinct or partially connate, membranous or papery\nsepals is also present. The androecium consists of usually 5 stamens that are opposite the\nsepals and which generally are united for part or all of their length into a membranous\ntube or crown-like structure, sometimes with minute appendages between the anthers. The\ncompound pistil of 2-3 carpels has 1-3 styles and a superior ovary with one locule\ncontaining one or sometimes several basal ovules. The fruit is usually a utricle or\ncircumscissile capsule. "}, {"family": "Amaranthaceae", "family_desc": " The Amaranthaceae are mostly herbs but\nrarely also shrubs or small trees comprising 169 genera and 2360 species further\ncharacterized by the presence of betalains and p-plastids. The leaves are alternate or\nopposite, simple, estipulate, and generally entire. The flowers are bisexual or unisexual,\ntypically very small and tightly clustered, actinomorphic, frequently prickly due to bristly perianth and\nbracts, or the floral parts fleshy. Each\nflower is often subtended by a bract and two bractlets that commonly are scarious or membranous.\nA minute uniseriate perianth of 3-5, distinct or partially connate, fleshy, membranous, or papery\nsepals is also present. The androecium consists of usually 3-5 stamens that are opposite the\nsepals and which are distinct or united for part or all of their length into a membranous\ntube or crown-like structure, sometimes with minute appendages between the anthers. The\ncompound pistil of 2-3 carpels has 1-3 styles and a superior ovary with one locule\ncontaining one or sometimes several basal ovules. The fruit is usually an\nachene, utricle, or\ncircumscissile capsule. "}, {"family": "Anacardiaceae", "family_desc": ""}, {"family": "Annonaceae", "family_desc": " The Annonaceae are woody trees, shrubs and vines comprising\r\nabout 130 genera and 2,300 species. The leaves are simple, alternate, lack stipules, and\r\ngenerally are distichously arranged in flat sprays. The flowers are bisexual and\r\nactinomorphic, possessing 3 whorls of perianth with 3 segments in each whorl. The\r\nelongated floral axis also bears many helically disposed stamens and several to many\r\nsimple pistils. All of the floral parts are distinct. The stamens are very short,\r\nconsisting of the fertile central anther portion, a distal pad of fleshy connective\r\ntissue, and a short fleshy basal portion. The stamens are generally so tightly packed on\r\nthe receptacle that often only the fleshy connective tissue of each is exposed. The\r\npistils each have a superior ovary with one locule and 1-many parietal ovules. Sectioned\r\nseeds reveal channels or partitions in the ruminate endosperm. The pistils generally\r\nremain distinct and develop into berry-like fruits but sometimes they coalesce into\r\nmultiple fruits like the custard apple. "}, {"family": "Apiaceae", "family_desc": " The Apiaceae are mostly temperate herbs almost always\nwith umbellate inflorescences comprising about 300 genera and 3,000 species that are\ncommonly further distinguished by the presence of hollow stems and sheathing petioles. The\nleaves are nearly always alternate and pinnately or palmately compound or more than once\ncompound; stipules are generally absent. The flowers are typically small, mostly bisexual,\nmostly actinomorphic except in a few instances where pseudanthia are produced and the\nperipheral flowers have enlarged petals directed away from the center of the\ninflorescence. The calyx is reduced to 5 tooth-like sepals around the summit of the ovary\nor may even be obsolete. The corolla consists of 5 distinct, typically inflexed petals or\nrarely is lacking. The androecium comprises 5 distinct stamens arising from an epigynous\nnectary disk. The gynoecium consists of a single compound pistil of 2 carpels, 2 styles\nborne on an enlarged stylopodium, and an inferior ovary with 2 locules, each containing a\nsingle pendulous, apical-axile ovule. The fruit is a schizocarp. "}, {"family": "Apiaceae", "family_desc": "The Apiaceae are aromatic herbs, shrubs, trees, or\noccasionally lianas; stems often hollow in internodes; basic unit of\ninflorescence usually an umbel or less commonly a head, these simple or\ndistributed in umbels, racemes, spikes, or panicles.  The family includes about 460 genera and 4,250 species. The\nleaves are nearly always alternate and pinnately or palmately compound or more than once\ncompound, occasionally simple, but even then usually deeply dissected or lobed;\npetioles are often sheathing; stipules are present or absent. The flowers are typically small, mostly bisexual,\nmostly actinomorphic except in a few instances where pseudanthia are produced and the\nperipheral flowers have enlarged petals directed away from the center of the\ninflorescence. The calyx is reduced to 5 (occasionally more) tooth-like sepals around the summit of the ovary\nor may even be obsolete. The corolla consists of 5 (occasionally more) distinct\nor sometimes irregularly coherent, typically inflexed petals, or\nrarely the corolla is lacking. The androecium comprises distinct stamens\nequaling in number and alternating with the petals and arising from an epigynous\nnectary disk.  The gynoecium consists of a\nsingle compound pistil of 2-15 carpels, an equal number of styles or these connate into\none style, and an inferior ovary with 2-15 locules, each bearing a single pendulous, axile\novule. An epigynous nectary disk is generally confluent with the enlarged stylar base\n(stylopodium). The fruit is a berry or drupe that sometimes splits into one-seeded\nsegments (\"Aralioids\"), or a specialized schizocarp that splits into\ntwo 1-seeded segments (\"Apioides\")."}, {"family": "Apocynaceae", "family_desc": " The Apocynaceae are trees, shrubs or sometimes\nherbs, usually with milky sap comprising about 200 genera and 2,000 species. The leaves\nare simple, usually opposite and decussate, or whorled; stipules are usually absent. The\nflowers are bisexual and actinomorphic or sometimes weakly zygomorphic. The calyx is\nsynsepalous and usually 5-lobed. The corolla is sympetalous and usually 5-lobed. The\nstamens are distinct, as many as corolla lobes and alternate with them, and adnate to the\ncorolla tube (or perigynous zone). The anthers are introrse and commonly adherent to the\nsurface of the stigma. The gynoecium consists of a single compound pistil of 2 carpels\nthat may be distinct at the level of the superior or rarely partly inferior ovary but\nwhich are united by a single style. When distinct, each ovary typically has few to\nnumerous ovules on marginal placentae; when connate, the placentation is axile or intruded\nparietal. A nectary consisting of 5 glands or an annular ring is usually found at the base\nof the ovary. The fruit is commonly a follicle, capsule, or berry. The seeds usually are\nflat and winged or have a tuft of hairs at one end. "}, {"family": "Apocynaceae", "family_desc": " The Apocynaceae are trees, shrubs, herbs, and vines or\nlianas, sometimes succulent, usually with milky sap.  The family includes about\n355 genera and 3,700 species. The leaves\nare simple, usually opposite and decussate, sometimes whorled or alternate; stipules\nare reduced or absent. The\nflowers are bisexual and actinomorphic or sometimes weakly zygomorphic. The calyx\nconsists of usually 5 free or basally connate lobes. The corolla is sympetalous and usually\n5-lobed, often with adnate coronal appendages. The stamens are as many as corolla lobes and alternate with them,\nadnate to the\ncorolla tube (perigynous zone). The anthers are introrse and usually adherent to the\nsurface of the (often enlarged) stigma, or the anthers may be joined more firmly\nto the stigma so as to form a gynostemium (gynostegium) which commonly is also\nconjoined to coronal appendages.  Pollen is released as monads, tetrads, or\nin agglutinated masses called pollinia.  The pollinia are usually in pairs\nthat are transferred as a unit during pollination.  The gynoecium consists of a single compound pistil of 2 carpels\nthat may be distinct at the level of the superior or rarely partly inferior ovary but\nwhich are united by the single style and stigma, or at least by the single\nstigma.. When distinct, each ovary typically has a single locule with few to\nnumerous ovules on marginal placentae; when connate, the placentation is axile\n(2 locules) or intruded parietal (1 locule). A nectary consisting of 5 glands or an annular ring is usually found at the base\nof the ovary. The fruit is commonly a follicle, capsule, or berry. The seeds usually are\nflat and winged or have a tuft of hairs at one end. "}, {"family": "Aquifoliaceae", "family_desc": ""}, {"family": "Araliaceae", "family_desc": " The Araliaceae are mostly tropical shrubs and trees\r\ncomprising about 70 genera and 700 species. The leaves are alternate or rarely opposite,\r\npalmately or pinnately compound or more than once compound or rarely simple; stipules are\r\nusually present and liguliform or adnate to the petiole and sheathing. The flowers are\r\nactinomorphic and most frequently unisexual, often in heads or umbels. The perianth is\r\nbiseriate but the calyx is reduced to usually 5 minute teeth or a seamlike rim adnate to\r\nthe ovary. The corolla consists mostly of 5-10 usually more or less distinct, usually\r\nvalvate petals arising from a nectary disk on the summit of the ovary. The stamens are\r\ndistinct, usually as many as and alternating with the petals. The gynoecium consists of a\r\nsingle compound pistil of 2-15 carpels, an equal number of styles or these connate into\r\none style, and an inferior ovary with 2-15 locules, each bearing a single pendulous, axile\r\novule. An epigynous nectary disk is generally confluent with the enlarged stylar base or\r\nstylopodium. The fruit is a berry or drupe that sometimes splits into one-seeded segments.\r\n"}, {"family": "Aristolochiaceae", "family_desc": ""}, {"family": "Asclepiadaceae", "family_desc": " The Asclepiadaceae are mostly herbs and shrubs\nwith white sap comprising about 250 genera and 2,000 species, many of which are lianous\nand some of which are cactuslike succulents with reduced leaves. The leaves are simple and\nnearly always opposite or whorled; minute stipules are present. The flowers are bisexual,\nnearly always actinomorphic, and usually include an elaborate crown or corona of\nnectariferous appendages between the corolla and sexual parts. The calyx consists of 5\ndistinct or basally connate sepals. The inner perianth is a 5-lobed sympetalous corolla.\nThe androecium and gynoecium are nearly always adnate into a gynostegium with five highly\nmodified stamens and a massive, 5-lobed stigma. The anthers usually produce paired sacs of\npollen called pollinia that are transferred as a unit during pollination. The gynoecium\nconsists of a single compound pistil of two nearly distinct carpels that are separate at\nthe level of the ovaries and styles and are united only by a single massive stigma. The\novaries are distinct, nearly always superior, and each has a single locule with numerous\nmarginal ovules. The fruit is a follicle. Seeds usually have a tuft of hairs at one end."}, {"family": "Asteraceae", "family_desc": " The Asteraceae are herbs, shrubs, or less commonly\ntrees and are arguably the largest family of flowering plants, comprising about 1,100\ngenera and 20,000 species that are characterized by having the flowers reduced and\norganized into an involucrate pseudanthium in the form of a head or capitulum. The leaves\nare alternate, opposite, or less commonly whorled, and range from simple to pinnately or\npalmately compound; stipules are absent. Subtending and often partly enclosing the florets\nof the head is one or more series of usually green, free or variously connate bracts\ncalled involucral bracts or phyllaries. Another kind of bract called a receptacular bract\nor chaff may be associated with each disk floret throughout the head. The flowers are of\ntwo basic types: those with tubular actinomorphic corollas and those with strap-shaped or\nradiate zygomorphic corollas, often within the same head. Either type may be bisexual or\nunisexual. Where both types are found in a single head, the central flowers have tubular,\nusually 4-5- lobed corollas, and generally are bisexual, and the peripheral flowers have\nstrap-shaped corollas generally with 3 distal teeth, and are usually female. Sometimes the\nheads lack ray flowers and are said to be discoid, consisting of only bisexual florets\nwith tubular corollas. So-called disciform heads have bisexual central disk flowers\nsurrounded by female flowers that have a very slender tube and an extremely suppressed or\nobsolete ligule. Ligulate heads consist only of bisexual florets with corollas of the\nligulate or strap-shaped type but with generally 5 rather than 3 distal teeth. In another\nvariation some or all of the florets in the head have 2-lipped corollas. In all cases the\ncalyx is absent or so highly modified as hairs, bristles or scales on the ovary summit\nthat it is given the alternative name of pappus. The corolla is sympetalous with mostly\n3-5 lobes. The androecium nearly always consists of 4 or 5 stamens that are united by\ntheir anthers and are adnate to the corolla tube or epigynous zone, alternate with the\nlobes. The gynoecium consists of a single compound pistil of 2 carpels, a single 2-cleft\nstyle, and an inferior ovary with one locule and one basal ovule. During maturation of a\nflower, the style grows through the anther column, and as it does, hairs on the outer\nsurface of the closed style lobes brush the pollen that is released into the anther column\nto the distal opening where it is available for biotic pollinators. A nectary in the form\nof a scale or small cup is commonly found alongside or around the base of the style. The\nfruit is an achene (cypsela) which may have a persistent pappus that commonly functions in fruit\ndispersal.\n"}, {"family": "Balanophoraceae", "family_desc": ""}, {"family": "Balsaminaceae", "family_desc": ""}, {"family": "Basellaceae", "family_desc": ""}, {"family": "Bataceae", "family_desc": ""}, {"family": "Begoniaceae", "family_desc": ""}, {"family": "Berberidaceae", "family_desc": ""}, {"family": "Betulaceae", "family_desc": " The Betulaceae are monoecious trees and shrubs\ncomprising 6 genera and 120 species. The leaves are alternate and simple; the stipules are\noften deciduous. The male inflorescences are pendulous catkins composed of aggregations of\nvariously simplified 3-flowered cymes, each with a subtending bract and varying numbers of\nbractlets and 2-18 stamens. A 1-6-parted minute calyx is often present in each flower. The\nfemale inflorescences are conelike, erect or pendulous aggregations of 2-3-flowered cymes,\neach with a subtending bract and varying numbers of bractlets. Each female flower has a\nsingle compound 2-carpelled pistil with 2 deeply divided styles and an inferior or nude\novary. A placental septum divides the lower part of the ovary into 2 locules, each\ncontaining 2 ovules. The fruit is a 1-seeded indehiscent nut or samara. "}, {"family": "Bignoniaceae", "family_desc": " The Bignoniaceae are mostly tropical trees\nor shrubs comprising about 100 genera and 800 species that usually boast large, showy\nflowers and are often lianous. The leaves are nearly always opposite or whorled and are\nmost commonly pinnately compound or more than once compound; stipules are absent. The\nflowers are bisexual and zygomorphic. The synsepalous calyx usually has 5 teeth or lobes.\nThe sympetalous corolla usually has 5 teeth or lobes and is sometimes 2-lipped. The\nandroecium consists most commonly of 4 didynamous stamens that are attached to the corolla\ntube or epigynous zone, alternate with the lobes. The gynoecium consists of a single\ncompound pistil of 2 carpels, a single style, and a superior ovary with typically 2\nlocules, each bearing numerous axile ovules. An annular or cupular nectary disk is usually\nfound around the base of the ovary. The fruit is usually capsular with winged seeds, or\nsometimes indehiscent with wingless seeds. "}, {"family": "Bixaceae", "family_desc": ""}, {"family": "Bombacaceae", "family_desc": ""}, {"family": "Boraginaceae", "family_desc": "The Boraginaceae are herbs, shrubs or trees\ncomprising about 100 genera and 2,000 species that have flowers in helicoid cymes and\noften have herbage that is coarsely hairy. The leaves are simple, mostly entire, and\nalternate; stipules are lacking. The flowers are nearly always bisexual and actinomorphic.\nThe calyx consists of 5 distinct or connate sepals. The corolla is 5-merous, sympetalous,\nand often has small appendages in the throat. The androecium consists of 5 distinct\nstamens adnate to the corolla tube or perigynous zone and alternate with the corolla\nlobes. The gynoecium consists of a single compound pistil of 2 carpels, a single, often\ngynobasic style, and a superior, often deeply 4-lobed ovary with 4 locules, each\ncontaining a single basal-axile ovule. An annular nectary disk is sometimes present. The\nfruit consists of 4 1-seeded nutlets or a 1-4-seeded nut or drupe. "}, {"family": "Boraginaceae", "family_desc": "The Boraginaceae are herbs, shrubs or trees\ncomprising about 100 genera and 2,000 species that have flowers in helicoid cymes and\noften have herbage that is coarsely hairy. The leaves are usually simple, but\nare sometimes deeply lobed or even compound, entire to serrate, alternate; stipules are lacking. The flowers are nearly always bisexual and\nactinomorphic, usually in helicoid or scorpioid cymes.\nThe calyx consists of 5 distinct or connate sepals. The corolla is 5-merous,\nsympetalous,\nand often has small appendages in the throat. The androecium consists of 5 distinct\nstamens adnate to the corolla tube or perigynous zone and alternate with the corolla\nlobes. The gynoecium consists of a single compound pistil of 2 carpels; the\novary is superior.  In one configuration false ovary partitions result in 4\nlocules, each with a single basal-axile ovule;  the style is either\nterminal on an unlobed ovary or the ovary may be deeply lobed and the style\ngynobasic.  In a second configuration the ovary is either undivided or\npartially or completely divided by two intruded parietal placentae that usually\nbear numerous ovules; the style(s) one and somewhat lobed, 2 or 4, terminal on\nan unlobed ovary. An annular nectary disk is sometimes present. The\nfruit is capsular or consists of 4 1-seeded nutlets or a 1-4-seeded nut or drupe. "}, {"family": "Brassicaceae", "family_desc": "The Brassicaceae are herbs or rarely subshrubs\ncomprising about 350 genera and 3,000 species. The leaves are alternate or rarely opposite\nand typically are simple but sometimes have deeply parted segments; stipules are lacking.\nThe flowers are bisexual and almost always actinomorphic. The perianth consists of a calyx\nof 4 distinct sepals and typically a corolla of 4 distinct petals that are commonly clawed\nand diagonally disposed. The androecium is tetradynamous, consisting of 4 long inner\nstamens and 2 short outer stamens. The gynoecium consists of 2 carpels that are generally\nseparated by a persistent false partition called a replum. The superior ovary is usually\n2-loculed and bears few to many ovules on parietal placentae. At maturity, the 2 valves of\nthe fruit typically separate, leaving the ovules attached to the persistent replum. Long,\nnarrow fruits of this family are called siliques, short broad ones are called silicles. "}, {"family": "Brassicaceae", "family_desc": "The Brassicaceae are trees, shrubs or herbs\ncomprising about 419 genera and 4,130 species. The leaves are alternate or rarely opposite\nand typically are simple but may be deeply parted to palmately or rarely\npinnately compound; stipules lacking or generally small.\nThe flowers are bisexual and actinomorphic or occasionally zygomorphic. The perianth consists of a calyx\nof 4 distinct sepals and typically a corolla of 4 distinct petals that are commonly clawed\nand diagonally disposed. The androecium sometimes has numerous stamens but\ntypically consists of 6 and these are frequently of two lengths (4 long inner\nstamens and 2 short outer stamens = tetradynamous). The gynoecium is often\nstipitate and usually consists of 2 carpels that are generally\nseparated by a persistent false partition called a replum. The superior ovary is usually\n2-loculed and bears few to many ovules on parietal placentae. The fruit is\nusually a capsule, the two valves of which separate at maturity, leaving the ovules attached to the persistent replum. Long,\nnarrow fruits of this family are called siliques, short broad ones are called silicles. "}, {"family": "Buddlejaceae", "family_desc": ""}, {"family": "Burseraceae", "family_desc": ""}, {"family": "Buxaceae", "family_desc": ""}, {"family": "Buxaceae", "family_desc": ""}, {"family": "Cactaceae", "family_desc": "The Cactaceae are mostly spiny\nsucculents with photosynthetic stems comprising 30-200 genera and 1,000 to 2,000 species\nfurther characterized by the presence of betalains, and p-plastids. The leaves are\nalternate, generally extremely reduced and ephemeral or absent, or rarely they are well\ndeveloped and fleshy. The leaves are associated with highly modified axillary buds or\nshoots called areoles that bear spines. The flowers are mostly bisexual and actinomorphic\nand commonly have many weakly differentiated perianth segments arising from an epigynous\nzone. The androecium typically consists of a very large number of stamens arising from the\ninner face of the epigynous zone. The gynoecium consists of a compound pistil of 3-many\ncarpels, an equal number of stigmas, and an equal number of parietal placentae with\nnumerous ovules in the single locule of the inferior ovary. The fruit is a berry, often\nwith spines or bristles. "}, {"family": "Caesalpiniaceae", "family_desc": "The Caesalpiniaceae are mostly tropical and\nsubtropical trees and shrubs comprising about 150 genera and 2,200 species. The leaves are\nstipulate, alternate, and mostly pinnately compound but may be bipinnate or simple. Like\nthe other legume families the petiole base is commonly enlarged into a pulvinus. The\nflowers are in racemes, spikes or cymes, are zygomorphic, and are mostly weakly to\nstrongly perigynous. The perianth commonly consists of a calyx and corolla of 5 segments\neach; the petals are distinct, overlapping (i.e., imbricate) in bud, with the posterior\none (flag or banner) innermost in position. The androecium usually consists of 1-10\ndistinct or variously united stamens, some of which are commonly reduced to nonfunctional\nstaminodes. The pistil is simple, consisting of one style and stigma, and a superior ovary\nwith one locule containing 2-many marginal ovules. The fruit is usually a legume. "}, {"family": "Calycanthaceae", "family_desc": ""}, {"family": "Campanulaceae", "family_desc": "The Campanulaceae are herbs, shrubs, or rarely\nsmall trees comprising about 70 genera and 2,000 species usually with milky sap. The\nleaves are nearly always alternate and simple; stipules are absent The flowers are\nbisexual, and actinomorphic in the subfamily Campanuloideae but zygomorphic in the\nLobelioideae. The perianth and androecium are usually 5-merous, sometimes 3-10-merous. The\ncalyx and corolla each consist of connate segments. The stamens equal the number of\ncorolla lobes, alternate with them, and are adnate to the extreme base of the corolla or\nepigynous zone or more commonly arise from the annular epigynous nectary disk; the\nfilaments are distinct and the anthers are introrse and only weakly connivent around the\nstyle in the Campanuloideae but in the lobelioideae the introrse anthers and also often\nthe filaments are firmly connate. The gynoecium consists of a single compound pistil of\nusually 2 carpels and locules with numerous axile ovules in the subfamily Lobelioideae but\nusually consists of 3-5 carpels and locules with numerous axile ovules in the subfamily\nCampanuloideae. The single style commonly has a number of lobes or stigmas equal to the\nnumber of carpels. The ovary is nearly always inferior and is generally crowned with an\nepigynous annular nectary disk. The fruit is usually a capsule or berry. "}, {"family": "Cannabaceae", "family_desc": ""}, {"family": "Capparaceae", "family_desc": ""}, {"family": "Caprifoliaceae", "family_desc": ""}, {"family": "Caprifoliaceae", "family_desc": ""}, {"family": "Caricaceae", "family_desc": ""}, {"family": "Caryophyllaceae", "family_desc": "The Caryophyllaceae are herbs or rarely\nsubshrubs comprising about 75 genera and 2,000 species further characterized by p-plastids\nand usually swollen nodes. The leaves are simple, nearly always opposite and decussate,\nand are estipulate or sometimes have scarious stipules. The flowers are actinomorphic and\nmostly bisexual. Although the corolla rarely may be absent, the perianth typically\nconsists of a calyx of 5 connate sepals and a corolla of 5 distinct, frequently clawed\npetals. The stamens are in one or two whorls, either equaling or twice the number of\npetals. The gynoecium consists of a single compound pistil of 2-5 carpels, usually with an\nequal number of styles and with a superior ovary that has a single locule with numerous\nfree central ovules. In some cases the ovary is 3-5 loculed with axile placentation\nbasally and l-loculed with free central placentation above. Occasionally, there may be a\nsingle basal ovule. The fruit most commonly is capsular. "}, {"family": "Casuarinaceae", "family_desc": "The Casuarinaceae are monoecious or dioecious\r\ntrees and shrubs comprising one genus and about 50 species with green, jointed, whorled\r\nphotosynthetic branchlets. The leaves are minute and whorled. The male flowers are minute\r\nand are clustered at the tips of branchlets in catkin-like strobili. Each flower consists\r\nof a single stamen, a subtending bract and 2 pairs of bracteoles. The female flowers are\r\nin ovoid clusters, each flower consists of a pistil, a subtending bract and two\r\nbracteoles. The bicarpellate pistil has two long, filiform stigmas from a short style. The\r\novary initially has two locules with two ovules in each but one locule is generally\r\ncompletely aborted at anthesis. The bracts and bractlets enclosing the ovaries persist and\r\nbecome woody, closely resembling a cone. Eventually, the bracts of individual flowers\r\nseparate, releasing the 1-seeded samaroid fruits. "}, {"family": "Cecropiaceae", "family_desc": ""}, {"family": "Celastraceae", "family_desc": "The Celastraceae are trees and shrubs comprising\nabout 50 genera and 800 species that are sometimes climbing or vining. The leaves are\nsimple and alternate or opposite; stipules are small and caducous or absent. The flowers\nare bisexual or sometimes functionally unisexual, actinomorphic, and are small and often\ngreenish. The calyx comprises 4 or 5 usually basally connate sepals. The corolla is rarely\nabsent or more commonly consists of 4 or 5 distinct petals. The androecium consists of 4\nor 5 or rarely 10 distinct stamens that alternate with the petals. The gynoecium is a\nsingle compound pistil of 2-5 carpels, a single short style, and a superior or rarely half\ninferior ovary with 2-5 locules, each containing usually 2 axile ovules. An annular\nnectary disk surrounds and is usually adnate to the ovary. The fruit is a capsule, berry,\nsamara, or drupe. "}, {"family": "Celastraceae", "family_desc": "The Celastraceae are trees and shrubs comprising\r\nabout 50 genera and 800 species that are sometimes climbing or vining. The leaves are\r\nsimple and alternate or opposite; stipules are small and caducous or absent. The flowers\r\nare bisexual or sometimes functionally unisexual, actinomorphic, and are small and often\r\ngreenish. The calyx comprises 4 or 5 usually basally connate sepals. The corolla is rarely\r\nabsent or more commonly consists of 4 or 5 distinct petals. The androecium consists of 4\r\nor 5 or rarely 10 distinct stamens that alternate with the petals. The gynoecium is a\r\nsingle compound pistil of 2-5 carpels, a single short style, and a superior or rarely half\r\ninferior ovary with 2-5 locules, each containing usually 2 axile ovules. An annular\r\nnectary disk surrounds and is usually adnate to the ovary. The fruit is a capsule, berry,\r\nsamara, or drupe. "}, {"family": "Celtidaceae", "family_desc": ""}, {"family": "Ceratophyllaceae", "family_desc": ""}, {"family": "Chenopodiaceae", "family_desc": ""}, {"family": "Chloranthaceae", "family_desc": ""}, {"family": "Chrysobalanaceae", "family_desc": ""}, {"family": "Cistaceae", "family_desc": ""}, {"family": "Clusiaceae", "family_desc": "The Clusiaceae are trees or shrubs, usually with\nmilky or colored sap, comprising about 50 genera and 1200 species. The leaves are simple\nand are opposite, whorled, or rarely alternate. Stipules are absent. The flowers are\nactinomorphic and are usually functionally unisexual. The perianth consists of a calyx of\n2-10 imbricated, often decussate sepals and 4-12 petals. The stamens are generally\nnumerous and are distinct or variously united. The gynoecium consists of a single compound\npistil of 3-5 or more carpels, an equal number of stigmas, and a superior ovary of 3-5 or\nmore locules, each containing 1-many axile ovules. The fruit is usually a capsule or\nberry. "}, {"family": "Cneoraceae", "family_desc": ""}, {"family": "Combretaceae", "family_desc": "The Combretaceae are trees, shrubs, and lianas comprising\r\nabout 20 genera and 600 species. The leaves are simple, alternate or opposite,\r\nentire; stipules small or absent. The flowers are bisexual or sometimes\r\nunisexual, usually actinomorphic. The perianth arises from near the summit of a\r\ntubular epigynous zone; calyx of usually 4 or 5 distinct to slightly connate\r\nsepals; corolla commonly of 4 or 5 distinct petals, occasionally absent. The\r\nandroecium of 4-10 stamens is adnate to the epigynous zone, commonly in two\r\ncycles, often strongly exserted. The gynoecium is a single compound pistil of\r\n2-5 carpels; style and stigma 1; ovary inferior, with 1 locule containing 2(-6)\r\napical ovules pendulous on long funiculi. The nectary is usually a disk (often\r\nhairy) above the ovary.  The fruit is 1-seeded, often a flattened, ribbed,\r\nor winged drupe."}, {"family": "Connaraceae", "family_desc": ""}, {"family": "Convolvulaceae", "family_desc": "The Convolvulaceae are mostly twining herbs or\nshrubs, sometimes with milky sap, comprising about 85 genera and 2,800 species that are\nfurther characterized by almost always having the flowers solitary or in terminal or\naxillary dichasia. The leaves are simple, though sometimes lobed to pinnatisect, and\nalternate; stipules are absent. The flowers are actinomorphic, often showy, and nearly\nalways bisexual. The perianth and androecial whorls are 5-merous. The sepals of the calyx\nare usually distinct but the corolla is strongly sympetalous, plaited, and often rotate or\ntrumpet shaped with inconspicuous lobes. The stamens are often unequal, and are adnate to\nthe base of the corolla tube and alternate with the lobes. The gynoecium consists of a\nsingle compound pistil of 2 or rarely up to 5 carpels, usually an unbranched or 2-cleft\nstyle, and a superior ovary of 2 or sometimes up to 5 locules, each with 1 or 2 axile\novules. A prominent annular nectary disk is usually present around the base of the ovary.\nThe fruit is usually a loculicidal capsule. "}, {"family": "Convolvulaceae", "family_desc": "The Convolvulaceae are mostly twining herbs or\nshrubs, sometimes with milky sap, occasionally with little or no chlorophyll and\nparasitic, comprising about 55 genera and 1,930 species that are\nfurther characterized by almost always having the flowers solitary or in terminal or\naxillary dichasia. The leaves are simple, though sometimes lobed to pinnatisect,\nalternate, reduced in the parasitic forms; stipules are absent. The flowers are actinomorphic, often showy, and nearly\nalways bisexual. The perianth and androecial whorls are 5-merous. The sepals of the calyx\nare usually distinct but the corolla is strongly sympetalous, plaited, and often rotate or\ntrumpet shaped with inconspicuous lobes. The stamens are often unequal, and are adnate to\nthe base of the corolla tube and alternate with the lobes. The gynoecium consists of a\nsingle compound pistil of 2 or rarely up to 5 carpels, usually an unbranched or 2-cleft\nstyle, and a superior ovary of 2 or sometimes up to 5 locules, each with 1 or 2 axile\novules. A prominent annular nectary disk is usually present around the base of the ovary.\nThe fruit is usually a capsule. "}, {"family": "Coriariaceae", "family_desc": ""}, {"family": "Cornaceae", "family_desc": ""}, {"family": "Corynocarpaceae", "family_desc": ""}, {"family": "Crassulaceae", "family_desc": "The Crassulaceae are mostly succulents consisting of\nabout 25 genera and 900 species. The flowers are actinomorphic and have a calyx and\ncorolla comprising 4-6 or more segments that are free or connate. The number of stamens\nequal, or more frequently are twice the number of corolla segments. The gynoecium is\napocarpous, and the number of pistils equal the number of corolla segments. Each pistil is\nsimple, consisting of a single carpel with a single locule in a superior ovary that bears\nseveral to many marginal ovules. The fruit is usually a follicle. A scale-like\nnectar-secreting appendage is usually present at the base of each pistil. "}, {"family": "Cucurbitaceae", "family_desc": "The Cucurbitaceae are mostly prostrate or\nclimbing herbaceous annuals comprising about 90 genera and 700 species that are further\ncharacterized by commonly having 5-angled stems and coiled tendrils. The leaves are\nalternate and usually palmately 5-lobed or divided; stipules are absent. The flowers are\nactinomorphic and nearly always unisexual. The perianth has a short to prolonged epigynous\nzone that bears a calyx of 3-6 segments or lobes and 3-6 petals or more frequently a\n3-6-lobed sympetalous corolla. The androecium is highly variable, consisting of basically\n5 distinct to completely connate stamens that frequently are twisted, folded or reduced in\nnumber. The gynoecium consists of a single compound pistil of 2-5 carpels, generally with\none style and as many style branches or major stigma lobes as carpels, and an inferior\novary with one locule and usually numerous ovules on 2-5 parietal placentae or 3 locules\nwith numerous ovules on axile placentae. The fruit is a type of berry called a pepo. "}, {"family": "Cunoniaceae", "family_desc": ""}, {"family": "Cuscutaceae", "family_desc": ""}, {"family": "Dichapetalaceae", "family_desc": ""}, {"family": "Didiereaceae", "family_desc": "Each \"thumbnail\" image below\r\nis linked to a larger photograph."}, {"family": "Dilleniaceae", "family_desc": "The Dilleniaceae are trees, shrubs or\noccasionally vines comprising 10 genera and about 350 species. The leaves are simple and\nalternate, the stipules are absent or wing-like and adnate to the petiole. The flowers are\nactinomorphic and are bisexual or rarely unisexual. The perianth consists of 5 imbricate\nsepals and usually 5 imbricate petals. The androecium consists of numerous, distinct or\nfascicled stamens. The gynoecium comprises several distinct, simple pistils, each with a\nsuperior ovary and a single locule containing 1-many ovules. The fruit is a follicle or is\nberrylike. "}, {"family": "Dipsacaceae", "family_desc": ""}, {"family": "Droseraceae", "family_desc": ""}, {"family": "Ebenaceae", "family_desc": ""}, {"family": "Elaeagnaceae", "family_desc": ""}, {"family": "Elaeocarpaceae", "family_desc": ""}, {"family": "Epacridaceae", "family_desc": ""}, {"family": "Ericaceae", "family_desc": "The Ericaceae are mostly shrubs comprising about\n125 genera and 3,500 species. The leaves are simple and alternate or sometimes opposite or\nwhorled; stipules are absent. The flowers are bisexual and actinomorphic or sometimes\nslightly zygomorphic. The perianth is in two whorls, a 4-7 merous calyx of usually connate\nsepals, and a 4-7 merous corolla of usually connate petals. The androecium has as many, or\nmore commonly, twice as many stamens as corolla lobes or petals. The anthers dehisce by\nterminal pores and pollen is usually released in tetrads. The gynoecium consists of a\nsingle compound pistil of 2-10 carpels, usually a single style, and a superior or inferior\novary with 2-10 locules, each bearing numerous axile ovules. The fruit is a capsule or\nberry. "}, {"family": "Ericaceae", "family_desc": "The Ericaceae are mostly shrubs, trees, or less commonly\nmycotrophic herbs comprising about 130 genera and 2,700 species. The leaves are simple and alternate or sometimes opposite or\nwhorled; stipules are absent. The flowers are usually bisexual and actinomorphic or sometimes\nslightly zygomorphic. The perianth is in two whorls, a 4-7 merous calyx of usually connate\nsepals, and a 4-7 merous corolla of usually connate petals. The androecium has as many, or\nmore commonly, twice as many stamens as corolla lobes or petals. The anthers\ntypically dehisce by\nterminal pores and pollen is usually released in tetrads. The gynoecium consists of a\nsingle compound pistil of 2-10 carpels, usually a single style, and a superior or inferior\novary with 2-10 locules, each bearing 1-numerous, usually axile ovules. The fruit is\nusually a capsule or\nberry. "}, {"family": "Erythroxylaceae", "family_desc": ""}, {"family": "Eucommiaceae", "family_desc": ""}, {"family": "Euphorbiaceae", "family_desc": "The Euphorbiaceae are mostly monoecious herbs,\nshrubs, and trees, sometimes succulent and cactus-like, comprising one of the largest\nfamilies of plants with about 300 genera and 7,500 species that are further characterized\nby the frequent occurrence of milky sap. The leaves are mostly alternate but may be\nopposite or whorled and they are simple, or compound, or sometimes highly reduced.\nStipules are generally present but may be reduced to hairs, glands or spines. The flowers\nare unisexual and usually actinomorphic. They may be highly reduced by suppression of\nparts, in the extreme form consisting of a naked stamen as a male flower and a naked\npistil as a female flower. A specialized type of miniature inflorescence called a cyathium\noccurs in about 1,500 species comprising the genera Euphorbia and Chamaesyce.\nThe cyathium consists of a single naked pistillate flower surrounded by cymes of naked\nstaminate flowers, each consisting of a single stamen. These flowers are all enclosed in a\ncup-like involucre that typically is provided with peripheral nectaries and petaloid\nappendages such that the whole aggregation closely resembles a single flower. In other\nmembers of the family the flowers and inflorescences are more ordinary in appearance, with\nmale and female flowers typically bearing a 5-merous calyx and corolla of distinct\nsegments, although the corolla is sometimes absent. In these forms the androecium most\ncommonly consists of 5, 10 or sometimes numerous distinct or monadelphous stamens. The\ngynoecium of female flowers consists of a single compound pistil of typically 3 carpels,\nan equal number of styles or primary style branches, and a superior ovary with typically 3\nlocules, each bearing 1 or 2 collateral, axile-apical pendulous ovules. The fruit is\nusually a capsular schizocarp. "}, {"family": "Euphorbiaceae", "family_desc": "The Euphorbiaceae are mostly monoecious herbs,\nshrubs, and trees, sometimes succulent and cactus-like, comprising one of the largest\nfamilies of plants with about 300 genera and 7,500 species that are further characterized\nby the frequent occurrence of milky sap. The leaves are mostly alternate but may be\nopposite or whorled and they are simple, or compound, or sometimes highly reduced.\nStipules are generally present but may be reduced to hairs, glands or spines. The flowers\nare unisexual and usually actinomorphic. They may be highly reduced by suppression of\nparts, in the extreme form consisting of a naked stamen as a male flower and a naked\npistil as a female flower. A specialized type of miniature inflorescence called a cyathium\noccurs in about 1,500 species comprising the genera Euphorbia and Chamaesyce.\nThe cyathium consists of a single naked pistillate flower surrounded by cymes of naked\nstaminate flowers, each consisting of a single stamen. These flowers are all enclosed in a\ncup-like involucre that typically is provided with peripheral nectaries and petaloid\nappendages such that the whole aggregation closely resembles a single flower. In other\nmembers of the family the flowers and inflorescences are more ordinary in appearance, with\nmale and female flowers typically bearing a 5-merous calyx and corolla of distinct\nsegments, although the corolla is sometimes absent. In these forms the androecium most\ncommonly consists of 5, 10 or sometimes numerous distinct or monadelphous stamens. The\ngynoecium of female flowers consists of a single compound pistil of typically 3 carpels,\nan equal number of styles or primary style branches, and a superior ovary with typically 3\nlocules, each bearing 1 axile-apical pendulous ovule. The fruit is\nusually a capsular schizocarp. "}, {"family": "Fabaceae", "family_desc": "The Fabaceae are mostly herbs but include also shrubs\nand trees found in both temperate and tropical areas. They comprise one of the largest\nfamilies of flowering plants, numbering some 400 genera and 10,000 species. The leaves are\nstipulate, nearly always alternate, and range from pinnately or palmately compound to\nsimple. Like the other legume families the petiole base is commonly enlarged into a\npulvinus. The flowers are slightly to strongly perigynous, zygomorphic, and commonly in\nracemes, spikes, or heads. The perianth commonly consists of a calyx and corolla of 5\nsegments each. The petals are overlapping (imbricate) in bud with the posterior petal\n(called the banner or flag) outermost (i.e., exterior) in position. The petals are\nbasically distinct except for variable connation of the two lowermost ones called the keel\npetals. The lateral petals are often called the wings. The androecium most commonly\nconsists of 10 stamens in two groups (i.e., they are diadelphous with 9 stamens in one\nbundle and the 10th stamen more or less distinct). The pistil is simple, comprising a\nsingle style and stigma, and a superior ovary with one locule containing 2-many marginal\novules. The fruit is usually a legume. "}, {"family": "Fabaceae", "family_desc": "The Fabaceae are herbs, vines, shrubs, trees, and lianas found in both temperate and tropical areas. They comprise one of the largest\r\nfamilies of flowering plants, numbering 630 genera and 18,000 species. The leaves are\r\nstipulate, nearly always alternate, and range from bipinnately or palmately compound to\r\nsimple. The petiole base is commonly enlarged into a pulvinus that commonly functions in orientation of the\r\nleaves (sometimes very responsively, as in the sensitive plant, Mimosa pudica). \r\nThe flowers are usually bisexual, actinomorphic to zygomorphic, slightly to strongly perigynous,\r\nand commonly in\r\nracemes, spikes, or heads. The perianth commonly consists of a calyx and corolla of 5\r\nsegments each.  The androecium consists of commonly 1- many stamens (most\r\ncommonly 10), distinct or variously united, sometimes some of them reduced to\r\nstaminodes.  The pistil is simple, often stipitate, comprising a\r\nsingle style and stigma, and a superior ovary with one locule containing 2-many marginal\r\novules. The fruit is usually a legume, sometimes a samara, loment, follicle,\r\nindehiscent pod, achene, drupe, or berry.  The seeds often have a hard coat\r\nwith hourglass-shaped cells, and sometimes bear a u-shaped line called a\r\npleurogram."}, {"family": "Fagaceae", "family_desc": "The Fagaceae are monoecious trees and shrubs\ncomprising 6-8 genera and about 800 species. The leaves are alternate and simple; the\nstipules are deciduous. The male flowers have a 4-7 lobed perianth of tepals and 4-40\nstamens and are usually grouped in pendulous catkins. The female flowers are solitary or\nin small clusters. They have a 4-6 lobed perianth of tepals, and are often subtended by a\nseries of bracteoles comprising an involucre. The single compound pistil of 3-6 carpels\nhas an inferior ovary with 3-6 locules and two basal or nearly basal ovules in each\nlocule. The fruit is called an acorn. It is a 1-seeded nut that is basally enveloped by a\ncupule derived from the involucre. "}, {"family": "Flacourtiaceae", "family_desc": ""}, {"family": "Fouquieriaceae", "family_desc": ""}, {"family": "Fumariaceae", "family_desc": ""}, {"family": "Garryaceae", "family_desc": ""}, {"family": "Gentianaceae", "family_desc": ""}, {"family": "Gentianaceae", "family_desc": ""}, {"family": "Geraniaceae", "family_desc": ""}, {"family": "Gesneriaceae", "family_desc": ""}, {"family": "Globulariaceae", "family_desc": ""}, {"family": "Goodeniaceae", "family_desc": ""}, {"family": "Grossulariaceae", "family_desc": ""}, {"family": "Grossulariaceae", "family_desc": ""}, {"family": "Gunneraceae", "family_desc": ""}, {"family": "Haloragaceae", "family_desc": " "}, {"family": "Hamamelidaceae", "family_desc": ""}, {"family": "Hamamelidaceae", "family_desc": ""}, {"family": "Hernandiaceae", "family_desc": ""}, {"family": "Hippocastanaceae", "family_desc": ""}, {"family": "Hippuridaceae", "family_desc": " "}, {"family": "Hydrangeaceae", "family_desc": ""}, {"family": "Hydrophyllaceae", "family_desc": ""}, {"family": "Icacinaceae", "family_desc": ""}, {"family": "Illiciaceae", "family_desc": ""}, {"family": "Juglandaceae", "family_desc": ""}, {"family": "Lamiaceae", "family_desc": "The Lamiaceae are mostly herbs or shrubs comprising\nabout 200 genera and 3,200 species, commonly with aromatic, herbage, quadrangular stems,\nand verticillate inflorescences. The leaves are opposite or whorled, and are simple or\noccasionally pinnately compound; stipules are absent. The flowers are bisexual and\nzygomorphic. The calyx is synsepalous, typically 5-merous, sometimes 2-lipped, and usually\nhas 5-15 conspicuous ribs. The corolla is sympetalous and typically bilabiate with 2 lobes\nforming an upper lip and 3 lobes forming a lower lip. The androecium consists of either 4\ndidynamous stamens or only two stamens that are adnate to the corolla tube or perigynous\nzone, alternate with the lobes. The gynoecium consists of a single compound ovary of 2\ncarpels, a single gynobasic style, and a deeply 4-lobed superior ovary with 4 apparent\nlocules (by intrusion of the ovary wall), each with a single basal-axile ovule. A\nhypogynous, often asymmetric nectariferous disk is generally present between the stamens\nand ovary. The fruit consists of four 1-seeded nutlets that rarely may be fleshy and\ndrupaceous. "}, {"family": "Lamiaceae", "family_desc": "The Lamiaceae are herbs shrubs, or trees comprising\nabout 258 genera and 6,970 species, commonly with aromatic, herbage, quadrangular stems,\nand verticillate inflorescences. The leaves are usually opposite or whorled, and are simple or\noccasionally pinnately compound; stipules are absent. The flowers are bisexual and\nzygomorphic, cymosely clustered on the secondary inflorescence axes. The calyx is synsepalous, typically 5-merous, sometimes 2-lipped, and usually\nhas 5-15 conspicuous ribs. The corolla is sympetalous and typically bilabiate with 2 lobes\nforming an upper lip and 3 lobes forming a lower lip. The androecium consists of either 4\ndidynamous stamens or only two stamens that are adnate to the corolla tube or perigynous\nzone, alternate with the lobes. The gynoecium consists of a single compound ovary of 2\ncarpels, an unlobed to deeply 4-lobed superior ovary with 4 apparent\nlocules (by intrusion of the ovary wall), each with a single basal-axile ovule.\nThe style is terminal to gynobasic; stigmas 2, tiny and inconspicuous, at the\napices of the style branches.  A hypogynous, often asymmetric nectariferous disk is generally present between the stamens\nand ovary. The fruit is a drupe with 1-4 pits, a 4-seeded indehiscent pod or a\nschizocarp splitting into four 1-seeded nutlets that rarely may be fleshy and\ndrupaceous. "}, {"family": "Lauraceae", "family_desc": "The Lauraceae are nearly all woody trees and shrubs comprising\r\n30 to 50 genera and about 2,000 species. An exception is the vining, leafless, parasitic\r\ngenus Cassytha. The leaves are simple, without stipules, and usually alternate. The\r\nflowers are actinomorphic, usually bisexual, and possess a perianth of six, basally\r\nconnate sepallike segments. The androecium most frequently comprises 4 whorls of 3 stamens\r\neach, although the inner whorls are often sterile. The filaments of the inner whorl\r\nusually have a pair of enlarged glandular appendages near the base. The anthers dehisce by\r\nmeans of commonly 4, upwardly opening flaps. The single simple pistil has a usually\r\nsuperior ovary with a single pendulous ovule in a solitary locule. The fruit is a berry or\r\na drupe, often surrounded basally by the short, persistent perianth cup. Unlike other\r\nMagnoliidae, the endosperm is completely absorbed by the embryo in Lauraceae. "}, {"family": "Lecythidaceae", "family_desc": ""}, {"family": "Leeaceae", "family_desc": ""}, {"family": "Lennoaceae", "family_desc": ""}, {"family": "Lentibulariaceae", "family_desc": ""}, {"family": "Limnanthaceae", "family_desc": ""}, {"family": "Linaceae", "family_desc": ""}, {"family": "Loasaceae", "family_desc": ""}, {"family": "Loganiaceae", "family_desc": ""}, {"family": "Loganiaceae", "family_desc": ""}, {"family": "Loranthaceae", "family_desc": ""}, {"family": "Lythraceae", "family_desc": "The Lythraceae are mostly tropical herbs or\r\noccasionally shrubs or trees comprising about 24 genera and 500 species. The leaves are\r\nsimple, usually opposite or whorled; stipules are minute or absent. The flowers are\r\nstrongly perigynous, actinomorphic or sometimes zygomorphic, commonly 4-,6-, or 8-merous.\r\nThe sepals appear as lobes of the perigynous zone, the petals are distinct and usually\r\ncrumpled. The stamens commonly are twice the number of petals, and are usually in two\r\nwhorls, one with the filaments longer than the other. The gynoecium consists of a single\r\ncompound pistil of usually 2-4 carpels, a single style and stigma, and a superior ovary\r\nwith usually 2-4 locules, each with numerous axile ovules. The fruit is commonly capsular.\r\n"}, {"family": "Lythraceae", "family_desc": "The Lythraceae are mostly tropical herbs or\r\noccasionally shrubs or trees comprising about 30 genera and 600 species. The leaves are\r\nsimple, usually opposite or whorled; stipules are minute or absent. The flowers are\r\nbisexual, strongly perigynous, actinomorphic or sometimes zygomorphic, commonly 4-,6-, or 8-merous.\r\nThe sepals appear as lobes of the perigynous zone, the petals are distinct and usually\r\ncrumpled. The stamens commonly are twice the number of petals, and are usually in two\r\nwhorls, one with the filaments longer than the other. The gynoecium consists of a single\r\ncompound pistil of 2-4 (-several) carpels, a single style and stigma, and a superior\r\n(to rarely inferior) ovary with usually 2-4 (-several) locules, each with 2-numerous axile ovules. The fruit is commonly capsular.\r\n"}, {"family": "Magnoliaceae", "family_desc": "The Magnoliaceae are woody trees and shrubs\ncomprising 12 genera and about 220 species. The leaves are simple, and alternate, usually\nwith deciduous stipules that enclose the bud. The flowers are bisexual, actinomorphic, and\nusually large, generally with 3 sepals and 6 to many petals. The androecium consists of\nmany helically disposed stamens, each with generally large microsporangia and usually a\nshort, poorly differentiated filament. The gynoecium is apocarpous, consisting of many\nhelically disposed simple pistils. Each pistil has a superior ovary with a single locule\nand one to several marginal ovules. All of the floral parts are distinct and are attached\nto an elongated receptacle. The pistils mature into follicles or less often berries or\nsamaras. "}, {"family": "Malpighiaceae", "family_desc": "The Malpighiaceae are trees and lianous shrubs\ncomprising about 60 genera and 1,200 species that are further characterized by the\npresence of often reddish, medifixed or variously branched hairs. The leaves are simple,\nusually opposite, and frequently have paired glands on the petiole or base of the blade;\nstipules are usually present. The flowers are mostly bisexual and are actinomorphic or\nweakly zygomorphic. The perianth typically consists of two whorls with 5 distinct segments\nin each. One or more of the sepals usually have one or more conspicuous glands. The petals\nare usually clawed and the limb is typically fringed or toothed. The androecium consists\nof usually 10 distinct or basally connate stamens in two whorls but some or half of them\nare commonly reduced to staminodes. The gynoecium consists of a single compound pistil of\nalmost always 3 carpels, 3 distinct styles, and a superior ovary with 3 locules, each\ncontaining a single pendulous, axile ovule. The fruit is variable. "}, {"family": "Malvaceae", "family_desc": "The Malvaceae are herbs, shrubs, or trees\ncomprising about 75 genera and perhaps as many as 1,500 species that are further\ncharacterized by the presence of stellate hairs and mucilaginous sap. The leaves are\nalternate, simple, and usually palmately veined; stipules are present. The flowers are\nalmost always bisexual and actinomorphic. The perianth consists of 5 valvate, distinct or\nbasally connate sepals and 5 distinct petals that are usually basally adnate to the\nandroecium. The androecium consists of very numerous monadelphous stamens with apically\ndivergent filaments bearing 1-celled anthers. The gynoecium is a single compound pistil of\n2-many carpels, an equal number of styles or style branches, and a superior ovary with\n2-many locules, each bearing 1-numerous ovules. The fruit is a loculicidal capsule,\nschizocarp, berry, or samara. "}, {"family": "Malvaceae", "family_desc": "The Malvaceae are trees, shrubs, lianas\nor herbs\ncomprising about 204 genera and about 2,330 species that are further\ncharacterized by the presence of stellate hairs and mucilaginous sap. The leaves are\nalternate, simple, and often palmately veined and lobed; stipules are present. The flowers are\nbisexual or functionally unisexual, usually actinomorphic, often associated with\nconspicuous bracts that form an epicalyx. The perianth consists of usually 5 valvate, distinct or\nbasally connate sepals and usually 5 distinct petals (sometimes lacking) that are\noften basally adnate to the\nandroecium. The androecium consists of 5-numerous stamens, these distinct,\nfascicled, or monadelphous with apically\ndivergent filaments; anthers 1- or 2-loculed; staminodes sometimes\npresent.  The gynoecium is a single compound pistil of\n2-many (sometimes loosely united) carpels with styles and stigmas equaling the\ncarpels in number and distinct, or variously united; the ovary is superior with\n2-many locules, each bearing 1-numerous, usually axile ovules. The fruit is a loculicidal capsule,\nschizocarp, nut, indehiscent pod, aggregate of follicles, drupe, or berry, or samara. "}, {"family": "Marcgraviaceae", "family_desc": ""}, {"family": "Melastomataceae", "family_desc": "The Melastomataceae are herbs, shrubs, or trees\ncomprising about 200 genera and 4,000 species that are further characterized by having the\nmajor leaf veins usually 3-9 palmate and running in a parallel fashion from the base of\nthe blade to near the leaf tip. The leaves are opposite and decussate or rarely alternate\nby abortion of one of the members of a pair; stipules are absent. The flowers are bisexual\nand actinomorphic to rather zygomorphic, at least with respect to the androecium and\nstyle. The perianth is biseriate, arising from a perigynous or epigynous zone. The calyx\nmost commonly consists of 5 valvate sepals but these may be coalesced into a hoodlike\ncalyptra. The corolla commonly has 5 distinct petals. The androecium most often consist of\ntwo whorls, each with the stamens equaling the number of petals but rarely has only one\nwhorl or numerous stamens. The stamens may be dimorphic but the functional ones are\ntypically claw-like, commonly with knee-like joints and appendaged anthers that open\nusually by terminal pores. The gynoecium consists of a single compound pistil of mostly\n4-14 carpels, a single style and stigma, and a superior or more commonly inferior ovary\nmostly with 4-14 locules and very numerous axile ovules. The fruit is a capsule or berry. "}, {"family": "Meliaceae", "family_desc": ""}, {"family": "Menispermaceae", "family_desc": ""}, {"family": "Menyanthaceae", "family_desc": ""}, {"family": "Mimosaceae", "family_desc": "The Mimosaceae are mostly tropical and subtropical\r\ntrees and shrubs comprising about 40 genera and 2,000 species. The leaves are nearly\r\nalways alternate, stipulate, and bipinnately compound (rarely once-pinnate) They usually\r\nhave swollen petiole bases called pulvini that commonly function in orientation of the\r\nleaves (remember the sensitive plant, Mimosa pudica). The inflorescence is commonly\r\na capitulum (also called a head). The flowers are hypogynous to slightly perigynous, have\r\nradial symmetry, petals that are valvate in bud, and commonly a 5-parted calyx and\r\ncorolla. The stamens are distinct to strongly monadelphous, numerous (rarely as few as\r\n10), and are generally more showy than the perianth. The pistil is simple, comprising a\r\nsingle style and stigma, and a superior ovary with 2-many marginal ovules in a solitary\r\nlocule. The fruit is usually a legume. "}, {"family": "Molluginaceae", "family_desc": ""}, {"family": "Monotropaceae", "family_desc": ""}, {"family": "Moraceae", "family_desc": "The Moraceae are monoecious or dioecious trees\nshrubs, lianas, or rarely herbs comprising 40 genera and 1,000 species, nearly all with\nmilky sap. The leaves are simple and alternate or rarely opposite. The stipules are small\nand lateral or sometimes they form a cap over the bud and leave a cylindrical scar. The\nflowers are unisexual and minute, and are usually densely aggregated. These aggregations\nfrequently take the form of pendulous aments or catkins. Usually, the perianth consists of\n4 or 5 undifferentiated tepals, but sometimes fewer or no perianth segments are present. A\ntypical male flower has four stamens, one opposite each perianth segment. The female\nflowers have a bicarpellate pistil, generally with two styles, although one may be\nsuppressed. The ovary is superior or inferior and contains a single pendulous ovule in a\nsolitary locule. Fruit types include drupes and achenes that are often coalesced or\notherwise aggregated into a multiple accessory fruit. "}, {"family": "Moringaceae", "family_desc": ""}, {"family": "Muntingiaceae", "family_desc": ""}, {"family": "Myoporaceae", "family_desc": ""}, {"family": "Myricaceae", "family_desc": ""}, {"family": "Myristicaceae", "family_desc": ""}, {"family": "Myrsinaceae", "family_desc": "The Myrsinaceae are trees or shrubs comprising\nabout 30 genera and 1,000 species. The leaves are simple, glandular punctate, usually\nalternate and coriaceous; stipules are absent. The flowers are actinomorphic and bisexual\nor unisexual. The calyx comprises 4-6 separate, or more commonly, basally connate sepals.\nThe corolla is usually gamopetalous, with 4-6 lobes. The androecium consists of 4-6\nstamens opposite the corolla lobes and usually adnate to the corolla. The anthers dehisce\nby longitudinal slits or commonly by apical pores or slits. The gynoecium consists of a\nsingle compound pistil of 3-6 carpels, a single style, and a usually superior ovary with a\nsingle locule containing one to several basal or free central ovules embedded in an\nengorged placenta. The fruit is a drupe. "}, {"family": "Myrtaceae", "family_desc": "The Myrtaceae, consisting of trees and shrubs found\nin the tropics, subtropics, and temperate Australia, comprises about 140 genera and 3,000\nspecies. The leaves are most commonly opposite, and frequently are glandular dotted;\nstipules are absent or vestigial. The flowers are actinomorphic, commonly with a\n4-5-parted calyx and corolla that is frequently reduced and inconspicuous compared to the\nwell-developed androecium of numerous stamens. The gynoecium consists of a single compound\npistil of 2-5 carpels, a single style and stigma, and a partly to wholly inferior ovary\nwith 2-5 locules and 2-many axile ovules (or occasionally a single locule with intruded\nparietal placentation). The fruit is usually a berry or loculicidal capsule. "}, {"family": "Nelumbonaceae", "family_desc": ""}, {"family": "Nepenthaceae", "family_desc": ""}, {"family": "Nyctaginaceae", "family_desc": "The Nyctaginaceae are herbs, shrubs, and\ntrees comprising 30 genera and 300 species further characterized by the presence of\nbetalains and p-plastids. The leaves are simple, entire, estipulate, and usually opposite.\nThe flowers are usually bisexual, have a 3-8-lobed uniseriate perianth of connate,\npetaloid sepals and are subtended by bracts that range in appearance from large and\nbrightly colored to reduced and calyx-like. The androecium consists of 1-30 hypogynous,\ncommonly unequal stamens that may be free or connate into a basal tube. The gynoecium is a\nsingle simple pistil with a superior ovary containing one locule and one basal ovule. The\nfruit is an achene that is often enveloped by the persistent base of the calyx tube. "}, {"family": "Nymphaeaceae", "family_desc": "The Nymphaeaceae are aquatic, rhizomatous herbs comprising eight genera and\n70 species.  The family is further characterized by scattered vascular bundles in the\nstems, and frequent presence of latex.  Leaves mostly alternate, simple, entire to\ndissected, submerged, floating, or emergent; stipules present or absent. \nFlowers solitary, bisexual, actinomorphic, long-pedicellate, floating or\nemergent; perianth of 4-6-many, commonly poorly differentiated, distinct or\nconnate, often petaloid segments, these often blending with staminodes. \nAndroecium of 3-many, laminar to filamentous stamens and commonly numerous\npetaloid or reduced staminodes, including transitional forms.  Gynoecium\napocarpous or more often syncarpous, of 3-numerous carpels, syncarpous forms\nwith as many locules as carpels and with an equal number of elongated, radiating\nstigmas; ovary superior to inferior; placentation parietal; ovules 1-numerous\n(commonly scattered on the partitions).  Fruit an aggregate of nuts, a\nberry, or an irregularly dehiscent fleshy capsule.  Seeds often arillate,\nmore or less lacking endosperm but with abundant perisperm."}, {"family": "Ochnaceae", "family_desc": ""}, {"family": "Olacaceae", "family_desc": ""}, {"family": "\"Olacaceae\"", "family_desc": ""}, {"family": "Oleaceae", "family_desc": "The Oleaceae are trees or shrubs comprising about 30 genera\r\nand 600 species. The leaves are opposite and simple or pinnately compound; stipules are\r\nabsent. The flowers are actinomorphic and bisexual or rarely unisexual. The calyx is\r\ntypically small and synsepalous, and most commonly 4-lobed but sometimes has more lobes or\r\nrarely is absent. The corolla is actinomorphic, 4-merous or sometimes up to 12-merous, and\r\nis nearly always sympetalous, though sometimes very deeply lobed. The androecium usually\r\nconsists of two stamens born on the corolla tube or perigynous zone, alternate with the\r\nlobes. The gynoecium consists of a single compound pistil of 2 carpels, a single or no\r\nstyle, and a superior ovary with 2 locules, each with usually 2 axile ovules. A nectary\r\ndisk is sometimes present around the base of the ovary. The fruit is variable. "}, {"family": "Onagraceae", "family_desc": ""}, {"family": "Orobanchaceae", "family_desc": ""}, {"family": "Orobanchaceae", "family_desc": "Herbs, including partial parasites with some chlorophyll (hemiparasites) and\ntotal parasites lacking chlorophyll (holoparasites), attaching to the roots of\nhost plants by many small haustoria or a single large haustorium.  Leaves\nalternate, opposite, or rarely whorled, simple to variously pinnately dissected\nso as to appear compound, sometimes reduced to scales; stipules absent. \nFlowers bisexual, zygomorphic or sometimes asymmetric; often associated with\nconspicuous, sometimes colorful bracts.  The perianth is biseriate, with a\nusually 5-lobed synsepalous calyx and a usually 2-lipped corolla with two lobes\n(sometimes completely fused and galeate) comprising the upper lip and three\nlobes comprising the lower lip.  The androecium consists of 4 didynamous\nstamens adnate to the corolla (perigynous zone); a fifth stamen sometimes is\nrepresented by a staminode.  The gynoecium consists of a single compound\npistil of 2 carpels; ovary superior ovary with 1 or 2 locules, each bearing\nnumerous parietal to axile ovules; style single, undivided, bearing a terminal,\n2-lobed stigma. A nectar disk is usually present around the base of the\novary.  The fruit is a septicidal to loculicidal capsule."}, {"family": "Oxalidaceae", "family_desc": "The Oxalidaceae are herbs, shrubs, or rarely trees\ncomprising 7 or 8 genera and about 800 species. The leaves are alternate and pinnately or\npalmately compound or rarely simple by suppression of leaflets; stipules are absent. The\nflowers are bisexual and actinomorphic. The perianth consists of a calyx of 5 distinct\nsepals and a corolla of 5 distinct or sometimes basally connate petals. The stamens are\nbasally connate and obdiplostemonous, that is, of two series with the outer series\nopposite the petals; occasionally 5 stamens are reduced to staminodes. The gynoecium\nconsists of a single compound pistil of 5 carpels, 5 distinct styles, and a superior ovary\nwith 5 locules, each containing one or more axile ovules. The fruit is a loculicidal,\nsometimes explosively dehiscent capsule or berry. "}, {"family": "Paeoniaceae", "family_desc": ""}, {"family": "Papaveraceae", "family_desc": "The Papaveraceae are herbs or rarely shrubs or trees\ncomprising 25 genera and 200 species that usually have milky or colored sap. The leaves\nare alternate and lack stipules. The flowers are actinomorphic, showy, and bisexual. The\ncalyx consists of 2 or 3 distinct or rarely completely connate sepals that are usually\ntorn off the receptacle as the bud opens. The corolla comprises 4-12 distinct petals in 1\nor 2 whorls. The petals are usually crumpled in bud. The androecium consists of numerous\nstamens. The gynoecium consists of a single compound pistil with a superior ovary and\nusually many parietal ovules in a single locule. The two to many carpels equal the number\nof placentae and stigmas. The fruit is generally capsular and commonly dehisces by way of\nvalves or by pores. "}, {"family": "Passifloraceae", "family_desc": ""}, {"family": "Pedaliaceae", "family_desc": "University of Hawai‘i at Mānoa\n3190 Maile Way, Room 101\nHonolulu, HI 96822"}, {"family": "Phyllanthaceae", "family_desc": ""}, {"family": "Phytolaccaceae", "family_desc": ""}, {"family": "Piperaceae", "family_desc": "The Piperaceae are fleshy herbs, soft shrubs, and infrequently\nsmall trees comprising 10 genera and 1,400 to 2,000 species. The nodes are commonly\nswollen or jointed. The leaves are alternate or rarely opposite or whorled, stipules are\nadnate to petiole or absent. The bisexual, or less commonly unisexual flowers are minute,\nlack perianth and usually are densely packed into rat-tail like spikes. Each flower is\nassociated with a peltate, umbrella-like bract. The androecium consists of 1-10 stamens.\nThe compound pistil has a superior ovary and consists of 1-5 carpels with a single locule\nand a solitary basal ovule. The fruit is a berry or drupe. "}, {"family": "Pittosporaceae", "family_desc": ""}, {"family": "Plantaginaceae", "family_desc": ""}, {"family": "Plantaginaceae", "family_desc": "The Plantaginaceae are herbs or sometimes small\nshrubs, sometimes aquatic, comprising about 114 genera and 2,100 predominately temperate\nspecies. The leaves are alternate,\nopposite, or sometimes whorled, and are simple; stipules are\nabsent. The flowers are usually bisexual and zygomorphic, but actinomorphic in Plantago,\nand reduced in Callitriche. The calyx is commonly 4-5 lobed or cleft. The\ncorolla is sympetalous, usually 4-5-lobed, often 2-lipped, and sometimes forms a\nnectary spur or sac. The androecium consists of 2 stamens or more commonly of 4\ndidynamous stamens adnate to the corolla tube or perigynous zone, alternate with the\nlobes; a fifth stamen is sometimes represented by a staminode. The gynoecium consists of a single compound pistil of 2\ncarpels, a single style,\nand a superior ovary with 2 locules, each\ncontaining numerous axile ovules.  A nectary disk is usually present at the base of the\novary (absent in Plantago and Callitriche). The fruit type is usually a capsule."}, {"family": "Platanaceae", "family_desc": ""}, {"family": "Plumbaginaceae", "family_desc": ""}, {"family": "Polemoniaceae", "family_desc": ""}, {"family": "Polygalaceae", "family_desc": ""}, {"family": "Polygonaceae", "family_desc": "The Polygonaceae are herbs, shrubs, or\nrarely trees comprising about 30 genera and 1,000 species. The leaves are simple,\nalternate or rarely opposite, and usually stipulate. The membranous, sheathing stipule is\ncalled an ocrea. The flowers are actinomorphic, usually small, and are bisexual or\noccasionally unisexual. The perianth is usually in two undifferentiated whorls comprising\n3-6 distinct or basally connate tepals. The androecium consists of 6-9, commonly 8\ndistinct or basally connate stamens, usually in two whorls. The gynoecium consists of a\ncompound pistil of usually 3 carpels, an equal number of style branches or styles, and a\nsuperior ovary with one locule containing a single basal ovule. The fruit is usually a\n3-angled or 3-winged achene. "}, {"family": "Portulacaceae", "family_desc": "The Portulacaceae are succulent herbs or\ninfrequently soft shrubs comprising about 20 genera and 500 species further characterized\nby the presence of betalains and p-plastids. The leaves are entire, alternate or opposite,\nusually fleshy, and usually with scarious or hairlike stipules. The flowers are bisexual\nand have what appears to be a differentiated perianth consisting of 2 distinct or basally\nconnate sepals and mostly 4-6 distinct or basally connate petals. The stamens and petals\nare isomerous, opposite, and sometimes adnate or the stamens may number 2-4 times as many\nas the petals. The gynoecium consists of a single compound pistil of 2-3 carpels with a\n2-5 branched style and a superior or half inferior ovary that has a single locule\ncontaining 1-many basal ovules. The fruit is usually a circumscissile or loculicidal\ncapsule. "}, {"family": "\"Portulacaceae\"", "family_desc": "The Portulacaceae are succulent herbs or\ninfrequently soft shrubs comprising about 20 genera and 500 species further characterized\nby the presence of betalains and p-plastids. The leaves are entire, alternate or opposite,\nusually fleshy, and usually with scarious or hairlike stipules. The flowers are bisexual\nand have what appears to be a differentiated perianth consisting of 2 distinct or basally\nconnate sepals and mostly 4-6 distinct or basally connate petals. The stamens and petals\nare isomerous, opposite, and sometimes adnate or the stamens may number 2-4 times as many\nas the petals. The gynoecium consists of a single compound pistil of 2-3 carpels with a\n2-5 branched style and a superior or half inferior ovary that has a single locule\ncontaining 1-many basal ovules. The fruit is usually a circumscissile or loculicidal\ncapsule. "}, {"family": "Primulaceae", "family_desc": ""}, {"family": "Proteaceae", "family_desc": "The Proteaceae are mostly southern hemisphere tropical and\r\nsubtropical evergreen shrubs and trees comprising about 75 genera and 1,000 species. The\r\nleaves are simple, estipulate, and mostly alternate. The flowers are actinomorphic or\r\nzygomorphic, mostly perigynous, and often in dense cone-like inflorescences or heads with\r\ninvolucral bracts. The perianth is uniseriate, 4-parted, and valvate, with one stamen\r\nadnate to and opposite each lobe. The gynoecium consists of a single, simple pistil with a\r\nsingle long style that is often bent back on itself (at least in bud), a single stigma,\r\nand a superior, often stipitate ovary with one locule containing 1-many, usually marginal\r\novules. The fruit is a follicle, achene, samara, or drupe. "}, {"family": "Punicaceae", "family_desc": ""}, {"family": "Pyrolaceae", "family_desc": ""}, {"family": "Rafflesiaceae", "family_desc": ""}, {"family": "Ranunculaceae", "family_desc": "The Ranunculaceae are herbs or rarely shrubs\nor vines comprising 50 genera and 2,000 species. The leaves are typically alternate,\ncompound, and estipulate. The flowers are actinomorphic or less commonly zygomorphic and\nare usually bisexual. The perianth is usually in two, often 5-merous cycles that may or\nmay not be differentiated into calyx and corolla. The petals are usually nectariferous\nnear the base, and in Ranunculus there is a flap of tissue in this position.\nTypical flowers have many helically disposed stamens and simple pistils on an elongated\nreceptacle. All of the floral parts are distinct. Each pistil has a superior ovary with\none locule and 1-several parietal ovules. A single flower commonly produces a cluster of\nachenes or follicles. "}, {"family": "Resedaceae", "family_desc": ""}, {"family": "Rhamnaceae", "family_desc": "The Rhamnaceae are mainly trees or shrubs, sometimes\r\ntwining or climbing, comprising about 55 genera and 900 species. The leaves are simple,\r\nmostly alternate, and usually stipulate. The flowers are actinomorphic, commonly small and\r\ngreenish, and nearly always bisexual. The calyx is generally 5-lobed, typically arising\r\nfrom a perigynous or rarely an epigynous zone. The corolla consists typically of 5 clawed,\r\ndistinct petals or rarely is absent. The androecium comprises typically 5 stamens that are\r\nopposite and commonly embraced by the petals. The gynoecium consists of a single compound\r\npistil of usually 2-4 carpels, a lobed or cleft style, and a superior or rarely inferior\r\novary with usually 2-4 locules, each with almost always a single basal ovule. An annular\r\nnectary disk surrounds and is usually adnate to the ovary. The fruit is usually\r\ndrupaceous. "}, {"family": "Rhizophoraceae", "family_desc": ""}, {"family": "Rosaceae", "family_desc": "The Rosaceae are trees, shrubs and herbs comprising\nabout 100 genera and 3,000 species. Most species have alternate leaves and stipules. These\nmay be adnate to the petiole. You have likely heard the saying, \"a rose is a rose is\na rose,\" suggesting that when you've seen one, you've seen them all. The family does\ntend to have somewhat monotonous actinomorphic flowers, commonly with 5-parted perianth\nand numerous stamens. However, closer inspection reveals that the gynoecium varies\ntremendously among different species of the family. In the subfamily Rosoideae many\napocarpous pistils mature into achenes while in the Prunoideae a single\nmonocarpellate pistil matures into a drupe. In subfamily Spiraeoideae the gynoecium\nconsists of two or more apocarpous pistils that mature into follicles. In all of these\ncases the ovary is superior and there is commonly some development of a perigynous zone.\nHowever, in a fourth subfamily, Maloideae, the ovary is compound and inferior, and\nan epigynous zone may occur. "}, {"family": "Rubiaceae", "family_desc": "The Rubiaceae are trees, shrubs, or infrequently\nherbs comprising about 450 genera and 6,500 species, including some lianous forms. The\nleaves are simple and usually entire, and are opposite or sometimes whorled; stipules are\npresent and interpetiolar. The flowers are nearly always bisexual and actinomorphic, often\nheterostylous, and usually are in cymose inflorescences. The calyx is mostly somewhat\nreduced and 4-5-lobed or sometimes the lobes are obsolete or rarely one of them greatly\nexpanded and brightly colored. The sympetalous corolla is mostly 4-5-lobed, occasionally\nwith 3 or up to 10 lobes. The androecium consists of as many stamens as corolla lobes and\nis adnate to the corolla tube or epigynous zone, alternate with the lobes. The gynoecium\nconsists of a single compound pistil of 2 or seldom more carpels, a single style, and a\nnearly always inferior ovary with the number of locules equaling the number of carpels,\neach with 1-many axile ovules. An epigynous nectary disk is usually present. The fruit is\nvariable, sometimes forming multiples. "}, {"family": "Rutaceae", "family_desc": "The Rutaceae are herbs, shrubs, and trees with\nglandular punctate, commonly strongly smelling herbage comprising about 150 genera and\n1,500 species that are further characterized by the common occurrence of spines and winged\npetioles. The leaves are alternate or opposite, simple or palmately or pinnately compound,\nor sometimes heathlike or reduced to spines; stipules are absent. The flowers are often\nsweet-scented, nearly always bisexual, and are actinomorphic or sometimes zygomorphic. The\ncalyx consists of 3-5 distinct or basally connate sepals and the corolla consists of 3-5\ndistinct or sometimes connate petals or rarely the petals are lacking. The androecium\nconsists of distinct or sometimes connate stamens that are commonly obdiplostemonous, that\nis in two whorls with the outer whorl opposite the petals. However, sometimes there may be\n(1)3-4 whorls or rarely up to 60 stamens. The gynoecium consists of a single compound\npistil of commonly 2-5 or more, often incompletely connate carpels that may be united only\nbasally or apically, either one or an equal number of styles, and a superior ovary with\nusually 2-5 or more locules, each bearing 1-several axile ovules. Generally, an\nintrastaminal nectary disk is situated between the stamens and the ovary. The fruit is\nvariable. "}, {"family": "Rutaceae", "family_desc": "The Rutaceae are herbs, shrubs, and trees with\nglandular punctate, commonly strongly smelling herbage comprising about 155 genera and\n930 species that are further characterized by the common occurrence of spines and winged\npetioles. The leaves are alternate or opposite, simple or palmately or pinnately compound,\nor sometimes heathlike or reduced to spines; stipules are absent. The flowers are often\nsweet-scented, nearly always bisexual, and are actinomorphic or sometimes zygomorphic. The\ncalyx consists of 3-5 distinct or basally connate sepals and the corolla consists of 3-5\ndistinct or sometimes connate petals or rarely the petals are lacking. The androecium\nconsists of distinct or sometimes connate stamens that are commonly obdiplostemonous, that\nis in two whorls with the outer whorl opposite the petals. However, sometimes there may be\n(1)3-4 whorls or rarely up to 60 stamens. The gynoecium consists of a single compound\npistil of commonly 2-5 or more, often incompletely connate carpels that may be united only\nbasally or apically, either one or an equal number of styles, and a superior ovary with\nusually 2-5 or more locules, each bearing 1-several axile ovules. Generally, an\nintrastaminal nectary disk is situated between the stamens and the ovary. The fruit is\nvariable. "}, {"family": "Salicaceae", "family_desc": ""}, {"family": "Salicaceae", "family_desc": ""}, {"family": "Santalaceae", "family_desc": ""}, {"family": "\"Santalaceae\"", "family_desc": ""}, {"family": "Sapindaceae", "family_desc": "The Sapindaceae are mostly trees and shrubs, and\ntendril-bearing vines comprising about 140 genera and 1,500 species. The leaves are\nalternate, simple, or more commonly pinnately compound; stipules are absent except in the\nclimbing forms. The flowers are small, actinomorphic or zygomorphic, and commonly\nfunctionally unisexual, although a given individual may bear seemingly bisexual flowers\ntogether with either male or female flowers. The perianth typically is biseriate,\nconsisting of calyx and corolla. The calyx comprises 4 or 5 distinct or sometimes basally\nconnate sepals. The corolla consists of 4 or 5 distinct petals or sometimes is absent. The\npetals commonly have basal appendages on the inner side. The stamens are distinct, often\nhave hairy filaments, and in quantity usually are equal to or twice the number of calyx\nlobes. The gynoecium consists of a single compound pistil of usually 3 carpels, commonly\nan equal number of styles or style lobes, and a superior ovary usually with 3 locules,\neach containing 1 or 2 axile or axile-apical ovules. Most species have an extrastaminal,\noften asymmetrical nectary disk situated between the stamens and corolla. The fruit is\nvariable. "}, {"family": "Sapindaceae", "family_desc": "The Sapindaceae are mostly trees and shrubs, and\ntendril-bearing vines or lianas comprising about 147 genera and 2,215 species. The leaves are\nalternate or opposite, simple, or more commonly pinnately compound or palmately\ncompound; stipules are absent except in the\nclimbing forms. The flowers are small, actinomorphic or zygomorphic, and commonly\nfunctionally unisexual, although a given individual may bear seemingly bisexual flowers\ntogether with either male or female flowers. The perianth typically is biseriate,\nconsisting of calyx and corolla. The calyx comprises 4 or 5 distinct or sometimes basally\nconnate sepals. The corolla consists of 4 or 5 distinct petals or sometimes is absent. The\npetals commonly have basal appendages on the inner side. The stamens are distinct, often\nhave hairy filaments, and in quantity usually are equal to or twice the number of calyx\nlobes. The gynoecium consists of a single compound pistil of usually 2 or 3 carpels, commonly\nan equal number of styles or style lobes, and a superior ovary usually with 2 or\n3 locules,\neach containing 1 or 2 axile or axile-apical ovules. Most species have an extrastaminal,\noften asymmetrical nectary disk situated between the stamens and corolla. The fruit is\nvariable. "}, {"family": "Sapotaceae", "family_desc": "The Sapotaceae are trees or shrubs with milky sap\ncomprising about 70 genera and 800 species that are often further characterized by the\npresence of reddish-brown hairs on the leaf undersides and other plant surfaces. The\nleaves are simple, coriaceous, alternate or rarely opposite, usually entire, with or\nwithout stipules. The flowers are bisexual and actinomorphic. The calyx consists of 4-12\nimbricate, biseriate or spirally disposed sepals that are usually basally connate. The\ncorolla is gamopetalous and generally has 4-12 imbricated lobes that sometimes are\nappendaged. The androecium is adnate to the corolla and usually consists of an inner whorl\nof fertile stamens equal in number and opposite to the corolla lobes, and often 1 or 2\nadditional whorls that are frequently reduced to staminodes or are obsolete. The gynoecium\ncomprises a single compound pistil, a single style, and a superior ovary typically with 4\nor 5 locules but sometimes fewer or up to 14, each with a single axile ovule. The fruit is\na berry. "}, {"family": "Sarcolaenaceae", "family_desc": ""}, {"family": "Sarraceniaceae", "family_desc": ""}, {"family": "Saururaceae", "family_desc": ""}, {"family": "Saxifragaceae", "family_desc": "Each \"thumbnail\" image below is linked to a\nlarger photograph."}, {"family": "Scrophulariaceae", "family_desc": "The Scrophulariaceae are mostly herbs or sometimes small\nshrubs comprising about 190 genera and 4,000 predominately temperate species, including\nmany which are partial root parasites (see Castilleja below and Pedicularis)\nand a few that are without chlorophyll and are wholly parasitic. The leaves are alternate,\nopposite, or sometimes whorled, and are simple to pinnately dissected; stipules are\nabsent. The flowers are bisexual and zygomorphic, and sometimes have brightly colored and\nconspicuous associated bracts. The calyx is commonly deeply 4-5 lobed or cleft. The\ncorolla is sympetalous, usually 4-5-lobed, sometimes 2-lipped, and sometimes forms a\nnectary spur or sac. The androecium consists of 2 or 5 stamens or more commonly of 4\ndidynamous stamens adnate to the corolla tube or perigynous zone, alternate with the\nlobes. The gynoecium consists of a single compound pistil of 2 carpels, a single style,\nand a superior, sometimes asymmetric ovary with 2 sometimes unequal locules, each\ncontaining numerous axile ovules. There is usually a unilateral or annular, frequently\nlobed nectary disk at the base of the ovary. The fruit type is usually a capsule. "}, {"family": "Scrophulariaceae", "family_desc": "The Scrophulariaceae are herbs or small\r\nshrubs comprising about 24 genera and 1,200 species. The leaves are alternate or\r\nopposite and are simple; stipules are\r\nabsent. The flowers are bisexual and zygomorphic to nearly actinomorphic. The calyx is commonly\r\n3-5 lobed or cleft. The\r\ncorolla is sympetalous, 4-5-lobed, and often 2-lipped. The androecium consists of 2,\r\n4, or 5 stamens (5th stamen sometimes staminodial), adnate to the corolla tube or perigynous zone, alternate with the\r\nlobes. The gynoecium consists of a single compound pistil of 2 carpels, a single style,\r\nand a superior ovary with 2 locules, each containing one (or more frequently) numerous\r\naxile ovules. A nectary disk is usually present at the base of the ovary. The fruit type is\r\na capsule or sometimes a schizocarp of 2 achenes. "}, {"family": "Simaroubaceae", "family_desc": ""}, {"family": "Simmondsiaceae", "family_desc": ""}, {"family": "Solanaceae", "family_desc": "Solanales. The Solanaceae are herbs, shrubs, or trees\ncomprising about 85 genera and 2,800 species that are frequently lianous or creeping. The\nleaves are alternate, usually simple, and lack stipules. The flowers are bisexual and\nactinomorphic or only slightly zygomorphic. The perianth and androecium whorls generally\nare isomerous and usually are 5- or sometimes 4- or 6-merous. The calyx is synsepalous,\nranging from tubular to deeply cleft. The corolla is sympetalous and ranges from forms\nwith a short tube and rather long, reflexed lobes to forms with a long tube and short\nlobes. The stamens are distinct, alternating with the lobes of the corolla, and adnate to\nthe corolla tube or perigynous zone. The gynoecium consists of a single compound pistil of\n2 carpels, a single style, and a superior ovary with 2 or rarely more locules by false\npartitioning, each with nearly always numerous axile ovules. A nectary disk is generally\npresent around the base of the ovary. The fruit is a berry or septicidal capsule. "}, {"family": "Sonneratiaceae", "family_desc": ""}, {"family": "Sterculiaceae", "family_desc": "The Sterculiaceae are trees, shrubs, or herbs\ncomprising about 65 genera and 1,000 species that are further characterized by the\npresence of stellate hairs. The leaves are alternate and simple or infrequently palmately\nlobed or compound; stipules are present but they are shed early. The flowers are\nactinomorphic or rarely zygomorphic, and are bisexual or not uncommonly functionally\nunisexual. The perianth is commonly uniseriate, consisting of 3-5 valvate, basally connate\nsepals, but sometimes an equal number of petals are also present. The androecium most\nfrequently consists of two whorls of 5 stamens each, these united by their filaments into\na tube that commonly surrounds the ovary or arises from an androgynophore. The gynoecium\nconsists of a single compound pistil of usually 4-5 sometimes weakly associated carpels,\nan equal number of distinct or variously connate styles, and a superior ovary with usually\n4-5 locules, each with 2-several axile ovules. The fruit is variable; sometimes the\ncarpels are completely distinct at maturity. "}, {"family": "Strasburgeriaceae", "family_desc": ""}, {"family": "Stylidiaceae", "family_desc": ""}, {"family": "Styracaceae", "family_desc": ""}, {"family": "Surianaceae", "family_desc": ""}, {"family": "Tamaricaceae", "family_desc": ""}, {"family": "Theaceae", "family_desc": "The Theaceae are trees or shrubs comprising about\n40 genera and 600 species. The leaves are alternate, simple, and estipulate. The flowers\nare actinomorphic and are bisexual or rarely unisexual. The perianth consists of distinct\nor basally connate segments differentiated into usually 5 imbricate sepals and 5 petals.\nThe androecium consists of numerous stamens that are distinct or basally monadelphous, or\nin 5 fascicles that are opposite and adnate to the petals. The gynoecium consists of a\nsingle compound pistil of 3-5 carpels, an equal number of styles, style-branches, or\nstigmas, and a superior ovary with 3-5 locules containing 2-many axile ovules. The fruit\nis usually a loculicidal capsule. "}, {"family": "Theophrastaceae", "family_desc": ""}, {"family": "Thymelaeaceae", "family_desc": "Rosidae: Myrtales. "}, {"family": "Tiliaceae", "family_desc": "The Tiliaceae are trees, shrubs, or rarely herbs\ncomprising about 50 genera and 450 species that are further characterized by the presence\nof branched or stellate hairs. The leaves are simple and nearly always alternate, stipules\nare present. The flowers are actinomorphic and nearly always bisexual. The perianth\nconsists of a valvate calyx with usually 5 distinct or basally connate sepals and a\ncorolla of an equal number of petals or sometimes the corolla is sepaloid or absent. The\nandroecium consists of usually many stamens that are distinct or basally connate or in\nfascicles. The gynoecium is a single compound pistil of 2-10 carpels, an equal number of\nstigmas, and a 2-10-loculed superior ovary with 1-several axile ovules in each locule. The\nfruit is variable. "}, {"family": "Tropaeolaceae", "family_desc": ""}, {"family": "Turneraceae", "family_desc": ""}, {"family": "Ulmaceae", "family_desc": ""}, {"family": "Ulmaceae", "family_desc": ""}, {"family": "Urticaceae", "family_desc": "The Urticaceae are monoecious or dioecious herbs\nor infrequently shrubs or small trees comprising 45 genera and 700 species, often with\nspecialized stinging hairs. The leaves are alternate or opposite, simple, and almost\nalways stipulate. The minute, unisexual flowers are in cymose clusters. The perianth is of\nmostly 4 or 5 undifferentiated tepals or is sometimes absent. The male flowers have a\nstamen opposite each perianth segment. The female flowers have a single simple pistil with\na superior or inferior ovary that contains one basal ovule in its solitary locule. The\nstigma is brushlike and elongated or is capitate. The fruit is an achene or drupe; in a\nfew species these coalesce to form a multiple. "}, {"family": "Valerianaceae", "family_desc": ""}, {"family": "Verbenaceae", "family_desc": "The Verbenaceae are herbs, shrubs, or trees\ncomprising about 100 genera and 2,600 species that are further characterized by the common\noccurrence of quadrangular twigs and/or aromatic herbage. The leaves are nearly always\nopposite or whorled, mostly simple; stipules are lacking. The flowers are nearly always\nbisexual and zygomorphic. The calyx is synsepalous and most commonly 5-merous. The corolla\nis sympetalous, usually unequally 5-lobed, and sometimes strongly 2-lipped. The androecium\nmost commonly consists of 4 didynamous stamens adnate to the corolla tube or perigynous\nzone, alternate with the lobes. The gynoecium consists of a single compound pistil of\nnearly always 2 carpels, a single terminal or subterminal style, and an unlobed or\nshallowly lobed ovary, usually with 4 locules (by false septation), each with a single\naxile ovule. A weakly developed annular nectary disk occurs around the base of the ovary\nin many species. The fruit is usually a drupe or nutlets. "}, {"family": "Verbenaceae", "family_desc": "The Verbenaceae are herbs, lianas, shrubs, or trees\r\ncomprising about 36 genera and 1,035 species that are further characterized by the common\r\noccurrence of quadrangular twigs and/or aromatic herbage. The leaves are nearly always\r\nopposite or whorled, mostly simple; stipules are lacking. The flowers are nearly always\r\nbisexual and zygomorphic, forming racemes, spikes, or heads. The calyx is synsepalous and most commonly 5-merous. The corolla\r\nis sympetalous, usually unequally 5-lobed, and often weakly 2-lipped. The androecium\r\nmost commonly consists of 4 didynamous stamens adnate to the corolla tube or perigynous\r\nzone, alternate with the lobes. The gynoecium consists of a single compound pistil of\r\nnearly always 2 carpels and an unlobed or\r\nshallowly lobed ovary, usually with 4 locules (by false septation), each with a single\r\naxile ovule.  The style is terminal and uncleft, bearing a conspicuous,\r\nusually bilobed stigma.  A weakly developed annular nectary disk occurs around the base of the ovary\r\nin many species. The fruit is usually a drupe with 2 or 4 pits or a schizocarp\r\nsplitting into 2 or 4 nutlets."}, {"family": "Violaceae", "family_desc": "The Violaceae are shrubs or herbs comprising\nabout 16 genera and 800 species. The leaves are alternate or rarely opposite, and are\nsimple; the stipules are minute or leafy. The flowers are bisexual, zygomorphic or\nsometimes actinomorphic, and sometimes cleistogamous. The perianth is differentiated into\n5 distinct or nearly distinct imbricate sepals and 5 imbricate petals, the lowermost of\nwhich is commonly spurred. The androecium consists of 5, nearly sessile, distinct or\nconnate stamens with anthers that are weakly coherent around the gynoecium. The two\nlowermost anthers commonly have nectariferous appendages that project backward into the\nspur of the lowermost petal. The gynoecium consists of a single compound pistil of 3-5\ncarpels, a single style, and a superior ovary with one locule containing 1-numerous ovules\non each of 3-5 parietal placentae. The fruit is a capsule or berry. "}, {"family": "Viscaceae", "family_desc": ""}, {"family": "Vitaceae", "family_desc": ""}, {"family": "Winteraceae", "family_desc": ""}, {"family": "Zygophyllaceae", "family_desc": ""}, {"family": "Agapanthaceae", "family_desc": ""}, {"family": "Agavaceae", "family_desc": ""}, {"family": "Agavaceae", "family_desc": ""}, {"family": "Alismataceae", "family_desc": " Taken together, the Alismataceae and\nLimnocharitaceae are aquatic herbs comprising about 15 genera and 85 species. The leaves\nare alternate and simple. The flowers are actinomorphic and bisexual or sometimes\nunisexual. The calyx consists of 3, usually persistent green sepals. The corolla consists\nof 3 deciduous, generally white or yellow petals. The androecium comprises mostly 6 to\nmany distinct stamens. The gynoecium is apocarpous, comprising 3-many, more or less\ndistinct simple pistils, each with a superior ovary containing a single locule with 1\nbasal ovule or less frequently several to many parietal ovules. Nectaries may be found on\nthe base of the pistils or on the receptacle. The fruit is an achene or less frequently a\nfollicle. "}, {"family": "Alliaceae", "family_desc": " "}, {"family": "Aloeaceae", "family_desc": ""}, {"family": "Alstroemeriaceae", "family_desc": ""}, {"family": "Amaryllidaceae", "family_desc": "The Amaryllidaceae are perennial herbs from a bulb with\r\ncontractile roots, comprising 50 genera and 870 species.  The leaves are\r\nalternate and more or less basal, simple, usually linear or lorate, flat,\r\nentire, parallel-veined, sheathing at base; stipules absent. The flowers are\r\nbisexual, often showy, actinomorphic to zygomorphic, usually in umbelloid cymes.\r\nThe perianth consists of 6 distinct or connate petaloid tepals, sometimes with\r\nan adnate corona. The androecium consists of 6 stamens attached to the\r\nreceptacle or adnate to the perianth tube; filaments free or connate, sometimes\r\nappendaged and forming a staminal corona. The gynoecium consists of a single\r\ncompound pistil of 3 carpels, a single style, one capitate or 3-lobed stigma,\r\nand an inferior ovary with 3 locules, each containing several to numerous axile\r\novules. The fruit is a loculicidal capsule or sometimes a berry.  The seed\r\ncoat usually has a black or blue crust."}, {"family": "Anthericaceae", "family_desc": ""}, {"family": "Araceae", "family_desc": " The Araceae are rhizomatous or tuberous herbs\ncomprising about 110 genera and 1,800 species, usually with calcium oxalate crystals or\nraphides and commonly with milky sap. The leaves are alternate, simple or compound,\npetiolate, sometimes very large, and usually with a sheathing base. The inflorescence is a\nfleshy spike or spadix subtended or commonly partially enveloped by a bract or spathe\nwhich is sometimes petaloid or brightly colored. The tiny flowers are actinomorphic,\nbisexual or unisexual, and are sessile or sometimes embedded in the floral axis. The\nperianth is nearly always absent in unisexual flowers but in bisexual flowers typically\nconsists of 4-6 small, undifferentiated tepals that are free or connate. The androecium of\na typical male flower usually consists of 2, 4, or 8 distinct or variously connate stamens\nthat are opposite the tepals when these are present. The gynoecium of a typical female\nflower consists of a single compound pistil of mostly 3 but up to 15 carpels, a single\nstyle, and a superior ovary with sometimes one locule and 1-numerous parietal\novules or\nmore frequently 3 or more locules, each with 1-numerous axile-apical to axile-basal\novules. The fruit is a berry. "}, {"family": "Araceae", "family_desc": "The Araceae are usually rhizomatous or tuberous (sometimes\ngiant) terrestrial (to rarely minute aquatic)  herbs\ncomprising about 108 genera and 2,830 species, usually with calcium oxalate crystals or\nraphides and commonly with milky sap. The leaves are alternate, simple or compound,\npetiolate, sometimes very large, and usually with a sheathing base. The inflorescence is a\nfleshy spike or spadix subtended or commonly partially enveloped by a bract or spathe\nwhich is sometimes petaloid or brightly colored. The tiny flowers are actinomorphic,\nbisexual or unisexual, and are sessile or sometimes embedded in the floral axis. The\nperianth is nearly always absent in unisexual flowers but in bisexual flowers typically\nconsists of 4-6 small, undifferentiated tepals that are free or connate. The androecium of\na typical male flower usually consists of 2, 4, or 8 distinct or variously connate stamens\nthat are opposite the tepals when these are present. The gynoecium of a typical female\nflower consists of a single compound pistil of mostly 3 but up to 15 carpels, a single\nstyle, and a superior ovary with sometimes one locule and 1-numerous parietal\novules or\nmore frequently 3 or more locules, each with 1-numerous axile-apical to axile-basal\novules. The fruit is usually a berry. "}, {"family": "Arecaceae", "family_desc": " The Arecaceae are woody shrubs, vines, or trees\ncomprising about 200 genera and 3,000 species that are further characterized by having\nlarge or very large leaves, each with a tubular sheathing base that typically splits open\non one side at maturity. The leaves are alternate, petiolate, and palmately or pinnately\ncleft to once or twice compound. The inflorescence is usually paniculate and is typically\nsubtended by one or more bracts or spathes that may become woody at maturity. The flowers\nare actinomorphic, generally small, and are bisexual or more often unisexual. The perianth\nusually consists of two whorls of 3 distinct or connate segments each, often distinguished\nprimarily by size, the outer series or calyx being the smaller. The androecium consists\ntypically of 6 distinct stamens in two whorls of 3 each but sometimes comprises up to\nseveral hundred variously connate or adnate stamens. The gynoecium is syncarpous or\napocarpous. Syncarpous forms consist of a single compound pistil of usually 3 carpels, 1\nor 3 styles, and a superior ovary with 3 locules, each containing a single basal, axile,\nor apical ovule. Apocarpous, forms consist of usually 3 simple pistils, each with a\nsuperior ovary containing one locule with a single basal to apical ovule. The fruit is\nusually a drupe. "}, {"family": "Asparagaceae", "family_desc": ""}, {"family": "Asphodelaceae", "family_desc": ""}, {"family": "Asteliaceae", "family_desc": ""}, {"family": "Bromeliaceae", "family_desc": "The Bromeliaceae are epiphytic herbs or\r\nsometimes terrestrial xerophytes comprising about 45 genera and 2,000 species that are\r\nfurther characterized by the presence of conspicuous floral bracts and scurfy, stalked,\r\npeltate scales on the leaves and other plant surfaces. The leaves are alternate,\r\nparallel-veined, usually stiffly lorate or strap-shaped, and troughlike, with a sheathing\r\nbase and commonly with spiny margins. The flowers are usually bisexual and actinomorphic\r\nbut unisexual and weakly zygomorphic forms are known. The perianth is in two dissimilar\r\nseries, each with 3 distinct to basally connate segments. The calyx is usually green but\r\nnot uncommonly petaloid and variously brightly colored. The corolla is typically brightly\r\ncolored and often the segments bear a pair of basal, sometimes nectariferous scales. The\r\nandroecium consists mostly of 6 stamens that are distinct or basally connate, and attach\r\nto the receptacle or are adnate to the base of the corolla. The gynoecium consists of a\r\nsingle compound pistil of 3 carpels, one style with 3 stigmas, and a superior to inferior\r\novary with 3 locules, each containing usually numerous axile ovules. The fruit is usually\r\na berry or capsule. "}, {"family": "Burmanniaceae", "family_desc": ""}, {"family": "Calochortaceae", "family_desc": ""}, {"family": "Cannaceae", "family_desc": ""}, {"family": "Colchicaceae", "family_desc": ""}, {"family": "Commelinaceae", "family_desc": "The Commelinaceae are herbs comprising about\n50 genera and 700 species that are often somewhat succulent and frequently have cymose\ninflorescences sometimes subtended by a boat-shaped spathe. The leaves are alternate,\nsimple, parallel-veined, and usually with a closed sheathing base. The flowers are\nbisexual and actinomorphic or commonly slightly to strongly zygomorphic. The perianth is\nin two usually differentiated series. The calyx is usually of 3 distinct herbaceous\nsepals. The corolla is usually of 3 equal or sometimes unequal, distinct, deliquescent\npetals. The androecium typically comprises 6 distinct stamens but commonly 3 or sometimes\nmore are reduced to staminodes. The gynoecium consists of a single simple pistil of 3\ncarpels, a single style and a superior ovary containing 3 or occasionally by abortion only\n2 locules, each containing 1-few axile ovules. The fruit is usually a loculicidal capsule\nor is sometimes indehiscent. "}, {"family": "Costaceae", "family_desc": ""}, {"family": "Cyanastraceae", "family_desc": ""}, {"family": "Cyclanthaceae", "family_desc": ""}, {"family": "Cyperaceae", "family_desc": "The Cyperaceae are grasslike, herbaceous plants\r\ncomprising about 70 genera and 4,000 species, commonly found in wet or saturated\r\nconditions. The stems are usually 3-angled and solid. The leaves are alternate, commonly\r\nin 3 ranks, usually with a closed sheathing base and a parallel-veined, strap-shaped\r\nblade. The flowers are very minute and are bisexual or unisexual. Each floret is in the\r\naxil of a chaffy bract and these are arranged spirally or distichously in spikelets.\r\nPerianth may be represented by scales or bristles in two whorls or may be entirely\r\nlacking. The androecium consists usually of 3 distinct stamens but 1, 2 or rarely 6 may be\r\npresent. The gynoecium consists of a single compound pistil of usually 2 or 3 carpels, a\r\nsingle style usually with 2 or 3 lobes or branches, and a superior ovary with a single\r\nlocule containing a single basal ovule. Sometimes the ovary is enveloped by a membranous\r\nsac called a perigynium. The fruit is a 3-angled or lens-shaped achene. "}, {"family": "Dioscoreaceae", "family_desc": ""}, {"family": "Eriocaulaceae", "family_desc": ""}, {"family": "Flagellariaceae", "family_desc": ""}, {"family": "Haemodoraceae", "family_desc": ""}, {"family": "Hanguanaceae", "family_desc": ""}, {"family": "Heliconiaceae", "family_desc": ""}, {"family": "Hemerocallidaceae", "family_desc": ""}, {"family": "Hesperocallidaceae", "family_desc": " "}, {"family": "Hyacinthaceae", "family_desc": " "}, {"family": "Hydrocharitaceae", "family_desc": ""}, {"family": "Hypoxidaceae", "family_desc": ""}, {"family": "Iridaceae", "family_desc": "The Iridaceae are perennial herbs from rhizomes,\nbulbs or corms comprising about 80 genera and 1,500 species. The leaves are distichous and\nhave a sheathing, equitant base and a generally ensiform or linear blade with parallel\nvenation. The flowers are bisexual, usually showy, and are actinomorphic or zygomorphic.\nThe perianth consists of 6 petaloid tepals in two differentiated or undifferentiated\nwhorls. Commonly all 6 tepals are united into a perianth tube or epigynous zone. The\nandroecium consists of 3 distinct or connate stamens positioned opposite and often adnate\nto the outer tepals. The gynoecium consists of a single compound pistil of 3 carpels, a\nsingle, commonly 3-branched style, and an inferior ovary with 3 locules, each containing\nfew to numerous axile ovules. The fruit is a loculicidal capsule. "}, {"family": "Joinvilleaceae", "family_desc": ""}, {"family": "Juncaceae", "family_desc": ""}, {"family": "Juncaginaceae", "family_desc": " "}, {"family": "Laxmanniaceae", "family_desc": ""}, {"family": "Lemnaceae", "family_desc": ""}, {"family": "Liliaceae", "family_desc": "As treated very broadly, the Liliaceae are mostly perennial herbs from\nstarchy rhizomes, corms, or bulbs comprising about 280 genera and 4,000 species. The\nleaves are alternate or less often opposite or whorled. The flowers are often showy and\nare nearly always bisexual and actinomorphic. The perianth typically consists of two\nwhorls of undifferentiated or weakly differentiated petaloid tepals with 3 distinct\nmembers in each whorl, or less frequently all of the segments are connate into a common\nperianth tube or perigynous or epigynous zone that sometimes has an adnate corona. The\nandroecium usually consists of 6 fertile stamens attached to the receptacle or adnate to\nthe perianth tube but rarely 3, 4, or up to 12 may be found. The gynoecium typically\nconsists of a single compound pistil of 3 carpels, a single style commonly with 3 stigmas,\nand a superior or less often inferior ovary with 3 locules, each containing several to\nnumerous axile ovules. Rarely there are 2 or 4 carpels and locules with axile placentation\nor only a single locule with intruded parietal placentation. The fruit is nearly always a\ncapsule or berry. "}, {"family": "Liliaceae", "family_desc": "The Liliaceae are mostly perennial herbs from bulbs, comprising about\n13 genera and 400 species. The\nleaves are alternate or whorled, simple, parallel-veined; stipules absent. The flowers are bisexual,\nactinomorphic or weakly zygomorphic, often showy. The perianth typically consists of two\nwhorls of undifferentiated or weakly differentiated petaloid tepals with 3 distinct\nmembers in each whorl. The\nandroecium usually consists of 6 fertile stamens with distinct filaments. The gynoecium typically\nconsists of a single compound pistil of 3 carpels, a single style commonly with 3 stigmas,\nand a superior ovary with 3 locules, each containing\nnumerous axile ovules. The fruit is a loculicidal capsule or sometimes a berry. \nSeeds usually flat and disk-shaped; seed coat not black."}, {"family": "Marantaceae", "family_desc": ""}, {"family": "Melanthiaceae", "family_desc": ""}, {"family": "Musaceae", "family_desc": "The Musaceae are large, often treelike\r\nperennial herbs comprising 2 genera and about 45 species. The leaves are alternate and\r\nvery large, with the proximal concentric, appressed sheathing portions comprising a\r\npseudotrunk from which the individual petioles and blades diverge. The blades are simple\r\nwith a prominent midrib and numerous penni-parallel lateral veins. Eventually, an\r\ninflorescence axis arising from the corm grows upward through the channel formed by the\r\noverlapping leaf bases and produces a terminal series of large overlapping bracts, each of\r\nwhich subtends and hides a cymose cluster of flowers. As each cyme reaches anthesis, the\r\nsubtending bract reflexes to expose the flowers and eventually abscises from the\r\ninflorescence axis. The flowers are zygomorphic and functionally unisexual, the proximal\r\nones being female and the distal ones male. The perianth comprises 2 series of 6 petaloid\r\ntepals, 5 of which are connate into a 5-lobed tube leaving one inner segment free. The\r\nandroecium usually consists of 5 fertile stamens and a staminode that is opposite the free\r\ntepal. The gynoecium consists of a single compound pistil of 3 carpels, a single style,\r\nand an inferior ovary with 3 locules, each containing numerous axile ovules. The fruit is\r\na berry, usually with a leathery, separable exocarp. "}, {"family": "Orchidaceae", "family_desc": "The Orchidaceae are terrestrial, epiphytic, or\r\nsaprophytic herbs comprising one of the two largest families of flowering plants with\r\nabout 1,000 genera and 15-20,000 species. The leaves are alternate or seldom opposite or\r\nwhorled and have a sheathing base and an entire, often fleshy, parallel-veined blade. The\r\nflowers are typically zygomorphic and bisexual but sometimes are virtually actinomorphic\r\nand rarely are unisexual. The perianth consists of 6 tepals in two similar or dissimilar\r\nwhorls. The outer whorl of 3 distinct or variously connate tepals is sometimes sepaloid.\r\nTwo members of the inner whorl of 3 tepals are alike and may be quite similar to the outer\r\ntepals. The third tepal of the inner whorl forms a labellum that typically is highly\r\nmodified in shape and or coloration. The androecium and gynoecium are nearly always adnate\r\ninto a column or gynostegium. Orchids in subfamily Cypripedioideae have two stamens, one\r\non each side of the column. Orchids in the largest subfamily Orchidoideae have a single\r\nterminal stamen and the anthers generally produce one or more waxy masses of pollen called\r\npollinia. The gynoecium consists of a single compound pistil of 3 carpels that together\r\nwith the androecium comprises the column in most species. The stigma is just proximal to\r\nthe single terminal stamen in most species. The stigma is two- or three-lobed and the\r\novary is inferior and almost always has 1 locule with very numerous, up to several\r\nmillion, very tiny parietal ovules. The fruit is mostly capsular. "}, {"family": "Pandanaceae", "family_desc": ""}, {"family": "Poaceae", "family_desc": "The Poaceae are mostly herbs comprising one of\nthe largest families of flowering plants with about 500 genera and 8,000 species. The\nstems are round and commonly hollow, at least in the internodes. The leaves are alternate,\nand commonly 2-ranked, proximally comprising an open sheathing base with overlapping\nmargins, and distally producing a parallel-veined, strap-shaped blade. On the adaxial leaf\nsurface at the junction of the blade and sheath is an often hairy fringe of tissue called\na ligule. The basic unit of the inflorescence is called a spikelet typically consisting of\na basal pair of minute sterile bracts called glumes and one or more distichously arranged\ndistal florets on an often zigzag extension of the spikelet axis called the rachilla. Each\nfloret is typically embraced by an additional pair of minute chaffy bracts called the\nlemma and the palea. The florets are unisexual or bisexual and have usually two or three\nbarely recognizable structures called lodicules that may represent a vestigial whorl of\nperianth that forces the lemma and palea apart during anthesis, thereby facilitating\nexsertion of the stamens and stigmas. The androecium typically consists of three or\noccasionally 6 distinct stamens. The gynoecium consists of a single compound pistil of 2\nor sometimes 3 carpels, an equal number of styles with feathery stigmas, and a superior\novary with one locule containing a single subapical to basal ovule. The fruit is usually a\ncaryopsis. "}, {"family": "Pontederiaceae", "family_desc": ""}, {"family": "Potamogetonaceae", "family_desc": ""}, {"family": "Restionaceae", "family_desc": ""}, {"family": "Ruscaceae", "family_desc": ""}, {"family": "Smilacaceae", "family_desc": ""}, {"family": "Strelitziaceae", "family_desc": ""}, {"family": "Taccaceae", "family_desc": ""}, {"family": "Tecophilaeaceae", "family_desc": ""}, {"family": "Themidaceae", "family_desc": ""}, {"family": "Trilliaceae", "family_desc": " "}, {"family": "Typhaceae", "family_desc": ""}, {"family": "\"Uvulariaceae\"", "family_desc": " "}, {"family": "Xanthorrhoeaceae", "family_desc": ""}, {"family": "Zingiberaceae", "family_desc": "The Zingiberaceae are perennial herbs mostly\nwith creeping horizontal or tuberous rhizomes comprising about 47 genera and 1,000\nspecies. The leaves are alternate and distichous, the base sheathing and the blade mostly\nlinear to elliptic with penni-parallel, strongly ascending veins. The flowers are\nbisexual, strongly zygomorphic, and often are associated with conspicuous floral bracts in\na spike or raceme. The perianth is in two whorls, an herbaceous or membranous 3-lobed or\nspathaceous tubular calyx and a petaloid tubular corolla with 3 lobes. The androecium\ntypically consists of 1 fertile stamen, a large opposing petaloid labellum representing 2\nconnate staminodia, and two smaller flanking petaloid staminodia. The gynoecium consists\nof a single compound pistil of 3 carpels, a single style nestled in a channel of the\nfilament and anther of the fertile stamen and an inferior ovary with typically 3 locules,\neach containing numerous axile ovules. Rarely the ovary is unilocular with parietal\nplacentation. The fruit is a loculicidal capsule or is berrylike. "}]